[
  {
    "id": "01279605-7404-4d07-ae02-0dd404cc76b4",
    "content": "Director James Cameron revealed that he and studio executives “clashed over certain things” about “Avatar” during the creation of the 2009 blockbuster film.\n\nCameron, whose epic adventure movie is the highest-grossing film of all time, told The New York Times on Friday that the creative process behind the film didn’t come without a fight.\n\nCameron — who did not refer to the studio by name — said studio executives thought the epic film “should be shorter” and characters were flying around too much on banshee creatures.\n\n“Well, it turns out that’s what the audience loved the most, in terms of our exit polling and data gathering,” Cameron recalled.\n\n“And that’s a place where I just drew a line in the sand and said, ‘You know what? I made “Titanic.” This building that we’re meeting in right now, this new half-billion dollar complex on your lot? “Titanic” paid for that, so I get to do this.’”\n\nAdvertisement\n\nThe director, who told The Times that “Avatar” is “still competitive with everything that’s out there these days,” claimed the studio later thanked him for his pushback.\n\n“I feel that my job is to protect their investment, often against their own judgment,” Cameron said. “But as long as I protect their investment, all is forgiven.”\n\nAdvertisement\nCameron’s reflections on the blockbuster arrived roughly three months before the scheduled release of its sequel — “Avatar: The Way of Water” — on Dec. 16.\n\nThe sequel arrives 13 years after the original film, a wait that Cameron said once left him a “little concerned” ahead of December.\n\n“I was a little concerned that I had stretched the tether too far, in our fast-paced, modern world ... [right] until we dropped the teaser trailer and we got 148 million views in 24 hours,” Cameron told The Times.\n\nAdvertisement\n“There’s that scarce seen but wondered at principle, which is, Wow, we haven’t seen that in a long time, but I remember how cool it was back then. Does that play in our favor? I don’t know. I guess we’re going to find out.”"
  },
  {
    "id": "10604013-842f-4c78-8bec-b17a093e2190",
    "content": "The new Hulu comedy series “Reboot” is a curious product of this particular cultural era. It follows the reboot of a fictional early 2000s family sitcom, “Step Right Up,” and the tensions it places on its dysfunctional cast and crew.\n\nAmong the stars of the show (and show within a show) are Keegan-Michael Key, Judy Greer and Johnny Knoxville, whose characters begrudgingly sign on for the reboot after many disappointing career and life changes since the original run. Paul Reiser — who was recently in a reboot of his own, with the 2019 revival of 1990s sitcom “Mad About You” — and Rachel Bloom play Gordon and Hannah, the father-daughter team of showrunners behind the relaunch of “Step Right Up.”\n\nPremiering Tuesday, the eight-episode series marks creator Steven Levitan’s first show since the long-running ABC sitcom “Modern Family.” HuffPost Senior Culture Reporters Marina Fang and Candice Frederick discuss what they thought of “Reboot” and assess where it fits into the larger cultural conversation on the topic.\n\nMarina Fang: All of us on the HuffPost culture desk talk a lot about the seemingly never-ending stream of reboots, revivals, re-imaginings, etc., etc. — what I often like to joke is the “reboot industrial complex.” So the idea of a sitcom about a fictional reboot of a sitcom, involving a lot of people who’ve been part of major sitcoms before, definitely piqued my interest. Candice, what did you think of “Reboot,” and how well do you think it captures this cultural moment we’re in?\n\nCandice Frederick: Yeah, the reboot industrial complex is real, and it’s exhausting. So, I went into “Reboot” fearing it would be a bit navel-gazey and unnecessary.\n\nAdvertisement\nBut I was struck by how much it delves into what it means to actually go forward with a reboot, the human impact of it. Like, how the actors, who haven’t worked in forever — or who haven’t gotten the type of prestige work they thought would follow after the series — are ill-equipped to deal with the new celebrity industrial complex where media can be very vampiric with their personal questions, or what it means to bring a show from a certain period into present day.\n\nWhat’s to become of the original staff writers? Can they write dialogue that pertains or contends with today’s culture? What does that look like when they have to share a writing room with younger writers? The generational questions were interesting to me.\n\nWhat did you think going into it?\n\nThe cast of \"Step Right Up\" — Reed (Keegan-Michael Key), Zach (Calum Worthy), Clay (Johnny Knoxville), and Bree (Judy Greer) — take a promotional photo for the show, in a scene from the Hulu series \"Reboot.\"\nThe cast of \"Step Right Up\" — Reed (Keegan-Michael Key), Zach (Calum Worthy), Clay (Johnny Knoxville), and Bree (Judy Greer) — take a promotional photo for the show, in a scene from the Hulu series \"Reboot.\"Michael Desmond/Hulu\nAdvertisement\nInitial Thoughts\nMF: Absolutely, I had those exact same fears. But I think it finds the right balance in its meta jokes about the industry. For example, the show within a show, like the show itself, is being produced at Hulu, and one of the characters is a fictionalized Hulu executive. That was all very funny.\n\nOnce I started watching it, I found myself wishing it had a sharper point of view about the concept of reboots — a specific thing it was trying to say about it all. But then, when you and I were deciding to do this “Should You Watch It?” article, you mentioned everything you said above. And I realized you’re totally right, that this is what really makes this show interesting.\n\nIn the larger cultural discussion around reboots, we don’t talk as much about what it means for the actors and writers to return to something they made 20 years ago, that probably hasn’t aged well, and how they’re probably in a very different place in their lives and careers when they decide to do these reboots. This show does a great job of exploring those dynamics.\n\nAdvertisement\nStandout Performances\nMF: The dynamic between Bree and Reed (Greer and Key) felt totally lived-in. Like, I totally bought that they had a thing 20 years ago, and being together again is bringing up all kinds of messy feelings. I loved both of those performances, part of a really stacked cast on this show.\n\nCandice, what did you think of the cast, and were there any really standout performances for you?\n\nCF: OMG yes! Loved that the comedy exec at Hulu (Krista Marie Yu) is hyperserious and actually knows nothing about comedy. I’m sure this happens a lot in the industry.\n\nKrista Marie Yu as Elaine, a fictionalized Hulu executive in charge of the \"Step Right Up\" reboot.\nKrista Marie Yu as Elaine, a fictionalized Hulu executive in charge of the \"Step Right Up\" reboot.Michael Desmond/Hulu\nAdvertisement\nTo your point, though, it did stick out to me that the show doesn’t have a point of view about reboots — especially since you and I both definitely do! But I also wonder if these folks who decide to do a reboot actually have a point of view on that. Some need the money. Others need their careers reinvigorated. Others, especially women like Judy Greer’s character, need to prove that they still have it and that the industry can’t send them out to pasture just yet. That was all very interesting to me.\n\nLOL, Judy and Keegan are comedy gold, totally agree. You know who I also thought was quite interesting? Alyah Chanelle Scott, who plays Timberly, who’s kind of a plant from the reality TV show industrial complex. She parlayed that into a scripted TV career. But when she tries to prove herself, of course people like Bree feel threatened. That was a totally unexpected storyline that actually made a lot of sense to me, and I think both women are very good there.\n\nWhat did you think of Johnny Knoxville and his character (who I admit I have never actually seen on anything before)? I intentionally avoided the whole “Jackass” phenomenon.\n\nAdvertisement\nKnoxville as Clay and Key as Reed on the set of \"Step Right Up.\"\nKnoxville as Clay and Key as Reed on the set of \"Step Right Up.\"Michael Desmond/Hulu\nMF: Yes, I liked how that all felt very real!\n\nI also have never watched any of the installments of the “Jackass” franchise. I did like that his character seemed pretty reflective of a washed-up, middle-aged white dude — like, you can easily picture a real-life equivalent.\n\nCF: Same! He is definitely a major source of comic relief but actually has gravitas. Like a whole lot of these characters, he’s been sort of just ... floating since this TV show. So, we get to see him really wrangle with that as well.\n\nAdvertisement\nSo, there’s a whole other section of the show that could have possibly been its own series, which is the relationship between Rachel Bloom’s and Paul Reiser’s characters, Hannah and Gordon. As a stand-alone character, I think Gordon is actually more interesting as the returning showrunner who’s trying to navigate the new turf and having to partner with his daughter, Hannah. Hannah is the more unsure character, who’s still getting her feet wet. But we again see how these two generations can work together.\n\nGordon (Paul Reiser) and Hannah (Rachel Bloom), the father-daughter team of showrunners on \"Step Right Up.\"\nGordon (Paul Reiser) and Hannah (Rachel Bloom), the father-daughter team of showrunners on \"Step Right Up.\"Hulu\nMF: Yeah, I liked seeing the writers room, which is another place where the show could have gotten a bit too navel-gazey, but it really works. Gordon is used to doing things the old way: hiring all of his friends, writing a bunch of hacky, tired jokes, etc. Meanwhile, Hannah is trying to make a more substantive show and hire a more inclusive writers room. The way they are constantly at an impasse feels like a lot of what we see play out in real life.\n\nAdvertisement\nWere there any other high points for you, or anything else you wanted to shout out? I think it’s safe to say we both liked it.\n\nCF: Yes! The genuineness of their reactions really worked. Like, that is exactly how I would imagine it would be.\n\nShould “Reboot” Get Another Season?\nCF: I think one question that came to mind is whether this deserves another season. Like, do we want more of this story? Honestly, I’d watch. I think there is more story to mine here.\n\nAdvertisement\nMF: That’s a good question! Like a lot of streaming series, these eight episodes tell a complete story but also leave just enough of an opening for another season. I could go either way. If they do pick it up for a second season, I’d watch it.\n\nCF: Same! I’d like to know more about these people. Somewhat related: Did you ever watch the show “Unreal”? I think this would make a good companion piece because of what they both say about the human impact of putting on what are ultimately scripted TV shows.\n\nMF: Yes, I did watch and really liked “Unreal,” until it went off the rails in its later seasons. There was also a short-lived Fox show last year called “The Big Leap,” which is similar to “Unreal” but the show within a show is a dance competition series — another possibility, if you’re reading this and want to check out more of these shows with meta qualities about TV. Can we call them “Russian doll shows”? LOL.\n\nAdvertisement\nCF: Haha I love that — and now I have to find “The Big Leap”! Never even heard of it."
  },
  {
    "id": "11806026-3e9f-47d4-b89d-07633efe23e3",
    "content": "Virginia “Ginni” Thomas, the wife of Supreme Court Justice Clarence Thomas, has agreed to be interviewed by the House select committee investigating the events of Jan. 6, 2021, sometime in the coming weeks.\n\nThe news was first reported by CNN correspondent Jamie Gangel and then later by MSNBC’s Ali Vitali, who said Thomas responded to a letter asking her to appear before the committee and was not subpoenaed.\n\nThomas’ involvement in former President Donald Trump’s “stolen election” lies and the U.S. Capitol riot has been a subject of interest for a while, especially since there is evidence she urged at least two Wisconsin state lawmakers, including the chair of the Senate elections committee, to overturn President Joe Biden’s 2020 election win.\n\nShe also reportedly sent messages to more than two dozen lawmakers in Arizona, arguing, without evidence, that there had been widespread election fraud in the 2020 presidential election.\n\nIn addition, there are texts in which Thomas urged then-White House chief of staff Mark Meadows to continue the battle to overturn election results, as well as texts and emails to Trump ally attorney and “coup memo” author John Eastman discussing how to upend the vote.\n\nAdvertisement\n“Help This Great President stand firm, Mark,” Thomas wrote Meadows after the 2020 election. “The majority knows Biden and the Left is attempting the greatest Heist of our History.”\n\nThomas had turned down other requests to appear before the House panel.\n\nIn June, her attorney Mark Paoletta said that there was no reason for her to testify before the House select committee and said he had “serious concerns” about any potential interview.\n\nNo date has been announced for Thomas’ interview with the committee, which will hold its next hearing Sept. 28.\n\nAdvertisement\nThe news understandably aroused the interest of Twitter users, many of whom predicted how her testimony might go.\n\n\nHeh. I bet she takes the 5th https://t.co/HXdbtQs7es\n\n— ProfB (@AntheaButler) September 21, 2022\n\nBREAKING: Ginni Thomas is testifying before the January 6 committee.\n\nMy take though: I’ll believe it when I see it. She may reverse course.\n\nBut if she shows up and pleads the Fifth — that will be a big deal.\n\n— Tristan Snell (@TristanSnell) September 21, 2022\nAdvertisement\n\nStill, others felt it was important to get her testimony on the record.\n\n\n\nNow will Clarence recuse himself from any Trump related case? He must. https://t.co/FPwMNkTI5P\n\n— Frank Figliuzzi (@FrankFigliuzzi1) September 21, 2022\nAdvertisement\n"
  },
  {
    "id": "249a810a-0bfb-42f3-ad8e-cac2c4bf03ff",
    "content": "Dr. Valery Polyakov, a physician-turned-cosmonaut who spent 437 days in outer space and set the world record, died at 80. Russian space agency Roscosmos announced his death on Monday without disclosing the cause or location.\n\n“His research helped prove that the human body is ready for flights not only to near-Earth orbit, but also to deep space,” Roscosmos wrote in a Telegram post. “We express our deepest condolences to the relatives and friends of Valery Vladimirovich.”\n\nHe was born Valery Ivanovich Korshunov on April 27, 1942, but changed his name after being adopted in 1957, according to the New Mexico Museum of Space History. Polyakov began as a physician and joined the Institute of Biomedical Problems in Moscow in 1971, according to CNN.\n\nAfter undergoing spaceflight training to demonstrate he could administer assistance to fellow astronauts in orbit and passing his exams in 1972, Polyakov became one of the first doctor-cosmonaut trainees in history. He earned his Candidate of Medical Sciences degree in 1976.\n\nPolyakov’s first lengthy space mission in 1988 lasted eight months, and he became deputy director of the institute he once joined as a young man upon returning back to Earth. It was his second and final mission, however, that made history.\n\nAdvertisement\nA photo of Polyakov taken as the Space Shuttle \"Discovery\" docked with the Mir space station.\nA photo of Polyakov taken as the Space Shuttle \"Discovery\" docked with the Mir space station.F. Carter Smith via Getty Images\nNow a specialist in the nascent field of space medicine, Polyakov volunteered to prove human beings could withstand microgravity and reach Mars, according to Wired. His flight to dock with Russia’s Mir space station launched on Jan. 8, 1994 — and Polyakov didn’t return until March 22, 1995.\n\nPolyakov orbited Earth 7,075 times and traveled around 187 million miles during those 14 months — during which millions of people back on Earth had marveled at the launch of the Netscape Navigator internet browser, the opening of the English Channel Tunnel and O.J. Simpson’s high-speed police chase.\n\nAdvertisement\nAccording to “The Story of Manned Space Stations” by Philip Baker, American astronaut Norman Thagard said Polyakov returned to Earth “big and strong” and looked “like he could wrestle a bear.” Polyakov exercised during his mission and refused assistance upon landing, opting to walk on his own.\n\n“When his capsule landed in Kazakhstan he walked from it to a nearby chair, a tremendous achievement,” wrote Baker. “He also stole a cigarette from a friend nearby, but could hardly be blamed for that. He sipped a small brandy and inwardly celebrated his mission.”\n\nWhile NASA astronauts Scott Kelly and Mark Vande Hei respectively spent 340 and 355 consecutive days in space and Peggy Whitson spent 665 cumulative days in space, the consecutive 437-day stay accomplished by Valery Polyakov remains unprecedented."
  },
  {
    "id": "251b98fc-4996-4652-bdba-8795d92418aa",
    "content": "A pilot was killed when their plane crashed into the ground during an annual air race championship in Nevada on Sunday afternoon, authorities said.\n\nThe single-engine plane was participating in the Jet Gold Race, one of the final events of the National Championship Air Races near Reno, when video shows the aircraft hitting the ground and skidding in flames.\n\nNo other people were harmed, officials said.\n\nWarning: Video and a photo below depict crashes at the event, which may be disturbing for some readers.\n\n\nThe pilot’s name was not released during a press conference that followed the crash.\n\n“I personally, and we as a board and the family, express our deepest sympathies to the pilot’s family and friends, as well as the racers and the race fans who make up our September family,” said Fred Telling, CEO of the Reno Air Racing Association, at the press conference.\n\nAdvertisement\nThe Federal Aviation Administration and the National Transportation Safety Board are investigating the crash.\n\nThe aerial event, first held in 1964, lauds itself as “the world’s fastest motor sport,” with participants flying at speeds that can exceed 500 mph.\n\nA P-51 Mustang airplane crashes into the edge of the grandstands during the airshow in 2011, killing 11 people.\nA P-51 Mustang airplane crashes into the edge of the grandstands during the airshow in 2011, killing 11 people.Ward Howes via AP\nAdvertisement\nBack in 2011, a World War II-era plane participating in the event crashed near the grandstand, killing the pilot, 10 people on the ground and injuring scores more. That crash was blamed on aged plane components, high speed and undocumented and untested modifications that had been made to the aircraft.\n\nThe crash led to a number of changes to the event, including a requirement that participating planes undergo safety tests before the race. Spectators are also seated farther from the race course."
  },
  {
    "id": "36f41634-6774-4605-ab45-f525a1022ee0",
    "content": "SILVER SPRING, Md. — For some, it’s hearing air raid sirens while talking with relatives back in Ukraine. For others, it’s the fear that Ukraine may become an economic basket case, even if it wins the war. Or that the world may forget the country’s plight altogether.\n\nUkrainans, their friends and those simply curious about the country that’s fought Russia to standstill gathered on a sun-splashed weekend at St. Andrew Ukrainian Orthodox Cathedral in suburban Washington for the region’s biggest annual Ukrainian cultural festival.\n\nAmid women wearing garlands in their hair, men wearing vyshyvanka — white shirts with intricately patterned embroidery down the front — and accompanied by traditional and pop Ukrainian music, the war was never far from people’s minds. What in past years had been a chance to showcase the culture and drink some beers from the home country had taken on a different, somewhat deeper meaning.\n\n“This year is particularly beautiful and sad at the same time,” said the church pastor, the Rev. Volodymr Steliac, as he formally opened the festival Saturday.\n\n“We have seen the worst of humanity but at the same time we have seen the best of humanity.”\n\nThe festival opened on Day 206 of the invasion and came amid good news for Ukraine: a surprise counteroffensive in the northeast that in a few days cleared Russians from towns and villages they had fought weeks to take earlier in the war.\n\nAdvertisement\nBut the victory came with a price. In the strategic town of Izium, mass graves were found, similar to those seen in the capital Kyiv’s suburb of Bucha when the war began.\n\n“We have seen the worst of humanity but at the same time we have seen the best of humanity.”\n\n- The Rev. Volodymr Steliac, St. Andrew Ukrainian Orthodox Cathedral\nOksana Sukhina, who was staffing the booth of the U.S. Ukraine Foundation, where she is project director, said she wanted to see what the impact of the latest reports of atrocities will be on Europe.\n\nAdvertisement\nIn the past, she said, some people suspected Ukrainians have exaggerated the cruelty of the Russians with reports of horrific claims like rape as a weapon of war and the theft of household goods then shipped to Russia.\n\n“Then you see Bucha, you see now Izyum. And we have yet to see Kherson and Mariupol and other places,” Sukhina said.\n\nSukhina, 50, immigrated to the U.S. from Kyiv in 2020. Warned by former colleagues in the State Department about the likelihood of invasion, her parents arrived in Washington only days before the war.\n\nAdvertisement\nBut as the prospect of Kyiv’s being captured receded, they went back, as did one of her daughters. They joined a 23-year-old son who left his IT job in Chicago in March to help deliver food and medical supplies in Kyiv.\n\nSukhina said she tried to convince him to stay, but could not forbid him to leave because she had participated in pro-democracy protests in 2004 and 2014.\n\n“I’m proud of them. They are trying to do whatever they can. And this is what makes us win,” she said.\n\nAdvertisement\nAttendees of the 2022 Washington Ukrainian Festival enjoy traditional music on the grounds of the Saint Andrew Ukrainian Orthodox Cathedral Saturday Sept. 17.\nAttendees of the 2022 Washington Ukrainian Festival enjoy traditional music on the grounds of the Saint Andrew Ukrainian Orthodox Cathedral Saturday Sept. 17.Jonathan Nicholson\nSteliac said the church was open 24-7 when the war began. He was only getting two or three hours of sleep a night as volunteers dropped off humanitarian aid, organized it and shipped it to Ukraine.\n\nIn one 48-hour period, he said, two of those young volunteers lost their fathers back in Ukraine.\n\n“The war is not there alone; the war is here as well,” Steliac said.\n\nEven though the process of gathering and sending aid has become more routine, even keeping in touch with family back home, he said, can be painful.\n\nAdvertisement\n“What was traumatic was that they were communicating with their relatives and they said, ‘Oh, a bomb fell just a couple of neighborhoods over’ and then they tried to connect again and the phone connection doesn’t go through,” Steliac said.\n\n“You think of the worst.”\n\nAlex Naumovych, a 36-year old mortgage loan officer from Ternopil in the western part of Ukraine, said he’s had calls interrupted by the air raid sirens, although now he said the alarms are likely to be ignored.\n\nTernopil, a city of about 250,000, has no military targets, but he said his parents still hear the sirens daily. Ukraine tracks incoming missiles and activates local warning systems based on where they could potentially land, so even residents of cities not targeted are warned.\n\nAdvertisement\n“I’m worried that, sooner or later, one of those missiles may hit my city, like my parents’ place,” Naumovych said.\n\nNaumovych arrived in the U.S. almost 11 years ago. He had about $440 to his name then, he said, and started a landscaping business he sold years later for more than $1 million.\n\n“I’m worried that, sooner or later, one of those missiles may hit my city, like my parents’ place.”\n\n- Alex Naumovych, mortage loan officer originally from Ternopil region of Ukraine\nAdvertisement\n“I love this country. Like you can come with $400 and six, seven years later you can be a millionaire,” he said.\n\nOne of his big worries for Ukraine now is its economy, with so many people out of work because of the war and inflation projected to hit 30%.\n\n“The economy is in bad shape,” Naumovych said. “A lot of people left Ukraine and I’m not sure they’re coming back”\n\nAdvertisement\nThe parents of software engineer Serhiy Vorobiov, 43, are near the war’s front line in Zaporizhzhya, a Russian-speaking region that includes Europe’s largest nuclear power plant. Russia has captured the plant and Ukrainians and others fear they will use it for blackmail.\n\nBut Vorobiov said his parents, only 25 miles from the front lines in the city of Zaporizhzhya, still think everything is relatively safe. He said he chats with them with about the same frequency as before the war.\n\n“Maybe because there is no very high emergency at this point. I know it’s not to my defense, but that’s how it is,” he said.\n\nAdvertisement\nVorobiov, his wife Oksana, 33, and their three young children, Yaromyr, Myroslava and Oksana, have lived in the U.S. since 2020. He said the war has reinforced his belief in getting rid of any Russian influence on their upbringing.\n\n“I always dreamed of it, I just didn’t want to be very tough in that. But now I have all the rights and I want to use it,” Vorobiov said.\n\n“I want them to forget [the] Russian language. We are from [the] Russian-speaking part of Ukraine, but now we are fixing it, as much as we can. Forget Russian, forget we were ever together, [forget] Soviet Union. I’m happy they don’t know what Soviet Union is.”\n\nAdvertisement\nPeople receiving humanitarian aid in June in Zaporizhzhya, Ukraine, near the largest nuclear plant in Europe.\nPeople receiving humanitarian aid in June in Zaporizhzhya, Ukraine, near the largest nuclear plant in Europe.SOPA Images via Getty Images\nBut in her remarks to open the festivities, Oksana Markarova, the Ukrainian ambassador to the United States, advised focusing on the present, not the past.\n\n“Please be joyful today,” she counseled.\n\nShe said Russian leader Vladimir Putin and the Russians want Ukrainians to “sit down and cry” at the devastation.\n\nAdvertisement\n“This is what Russians want us to do. And we will not give it to them.”"
  },
  {
    "id": "3c873573-e372-4d98-a8b2-b599f73719c6",
    "content": "LOS ANGELES (AP) — Maury Wills, who intimidated pitchers with his base-stealing prowess as a shortstop for the Los Angeles Dodgers on three World Series championship teams, has died. He was 89.\n\nWills died Monday night at home in Sedona, Arizona, the team said Tuesday after being informed by family members. No cause of death was given.\n\nWills played on World Series title teams in 1959, ’63 and ’65 during his first eight seasons with the Dodgers. He also played for Pittsburgh and Montreal before returning to the Dodgers from 1969-72, when he retired.\n\nDuring his 14-year career, Wills batted .281 with 2,134 hits and 586 stolen bases in 1,942 games.\n\nWills broke Ty Cobb’s single-season record for stolen bases with his 97th swipe on Sept. 23, 1962. That season he became the first player to steal more than 100 bases.\n\nThe Dodgers will wear a patch in memory of Wills for the rest of this season.\n\n“Maury Wills was one of the most exciting Dodgers of all time,” team president and CEO Stan Kasten said. “He changed baseball with his base-running and made the stolen base an important part of the game. He was very instrumental in the success of the Dodgers with three world championships.”\n\nAdvertisement\nWills had an ill-fated stint managing the Seattle Mariners from 1980-81, going 26-56 with a winning percentage of .317.\n\nHe was the National League Most Valuable Player in 1962, the same year he was MVP of the All-Star Game played in his hometown of Washington, D.C.\n\nWills stayed at home with his family instead of at the team hotel for the All-Star Game. He arrived at the ballpark carrying a Dodgers bag and wearing a Dodgers shirt. However, the security guard wouldn’t let him in, saying he was too small to be a ballplayer.\n\nAdvertisement\nWills suggested the guard escort him to the NL clubhouse door, where he would wait while the guard asked the players to confirm his identity.\n\n“So we walk down there and baseball players have a sick sense of humor, because when I stood in front of the door, with my Dodger shirt and duffel bag, and the man opened the door and said, ‘Anybody in here know this boy?’ and they all looked at me and said, ’Never saw him before,” Wills told The Washington Post in 2015.\n\nAfter the game, Wills left with his MVP trophy and showed it to the guard.\n\n“He still didn’t believe me, he thought maybe I was carrying it for somebody,” Wills told the Post.\n\nWills led the NL in stolen bases from 1960-65, was a seven-time All-Star selection and won Gold Glove Awards in 1961 and ’62.\n\nAdvertisement\nHe was credited with reviving the stolen base as a strategy. His speed made him a constant threat on the basepaths and he distracted pitchers even if he didn’t try to steal. He carefully studied pitchers and their pickoff moves when he wasn’t on base. When a pitcher’s throw drove him back to the bag, he became even more determined to steal.\n\nOnce, in a game against the New York Mets, Wills was on first base when pitcher Roger Craig threw 12 straight times to the bag. On Craig’s next throw, Wills stole second.\n\nBy age 32, Wills was bandaging his legs before games because of the punishment of sliding.\n\nAfter retiring with the Dodgers in 1972, Wills worked an analyst at NBC for five years. He also managed winter ball in the Mexican Pacific League, winning a league championship in 1970-71.\n\nAdvertisement\nWills’ tenure managing the Mariners was largely regarded as a disaster and he was criticized for his lack of managerial experience. It was evident in the numerous gaffes he committed, including calling for a relief pitcher when nobody was warming up in the bullpen and holding up a game for several minutes while looking for a pinch hitter.\n\nWills’ biggest mistake came on April 25, 1981, when he ordered the Mariners’ ground crew to extend the batter’s box a foot longer toward the mound than regulation allowed. Oakland manager Billy Martin noticed and asked home plate umpire Bill Kunkel to investigate.\n\nKunkel questioned the head groundskeeper, who admitted Wills had ordered the change. Wills said it was to help his players stay in the box. However, Martin suspected it was to give the Mariners an advantage against Oakland’s breaking-ball pitchers. Wills was suspended for two games by the American League and fined $500.\n\nAdvertisement\nWills led the Mariners to a 20-38 record to end the 1980 season, and he was fired on May 6, 1981, when the team was mired in last place at 6-18. Years later, Wills admitted he probably should have gotten more experience as a minor league manager before being hired in the big leagues.\n\nWills struggled with addictions to alcohol and cocaine until getting sober in 1989. He credited Dodgers pitching great Don Newcombe, who overcame his own alcohol problems, with helping him. Newcombe died in 2109.\n\n“I’m standing here with the man who saved my life,” Wills said of Newcombe. “He was a channel for God’s love for me because he chased me all over Los Angeles trying to help me and I just couldn’t understand that. But he persevered, he wouldn’t give in and my life is wonderful today because of Don Newcombe.”\n\nAdvertisement\nBorn Maurice Morning Wills in Washington, D.C., on Oct. 2, 1932, he was a three-sport standout at Cardozo Senior High. He earned All-City honors as a quarterback in football, in basketball and as a pitcher in baseball when he was nicknamed Sonny.\n\nIn 1948, he played on the school’s undefeated football team, which never gave up any points. On the mound, Wills threw a one-hitter and struck out 17 in a game in 1950. The school’s baseball field is named in his honor.\n\nWills has his own museum in Fargo, North Dakota, where he was a coach and instructor for the Fargo-Moorhead RedHawks from 1996-97.\n\nAdvertisement\nHe is survived by wife Carla, and children Barry, Micki, Bump, Anita, Susan Quam and Wendi Jo Wills. Bump was a former major league second baseman who played for Texas and the Chicago Cubs."
  },
  {
    "id": "443562c0-35d9-43bc-a553-e6b4b14e3b3a",
    "content": "KYIV, Ukraine (AP) — Russian-controlled regions of eastern and southern Ukraine announced plans Tuesday to start voting this week to become integral parts of Russia. The concerted and quickening Kremlin-backed efforts to swallow up four regions could set the stage for Moscow to escalate the war following Ukrainian successes on the battlefield.\n\nThe scheduling of referendums starting Friday in the Luhansk, Kherson and partly Russian-controlled Zaporizhzhia and Donetsk regions came after a close ally of Russian President Vladimir Putin said the votes are needed and as Moscow is losing ground in the invasion it began nearly seven months ago, increasing pressure on the Kremlin for a stiff response.\n\nFormer President Dmitry Medvedev, the deputy head of Russia’s Security Council chaired by Putin, said referendums that fold regions into Russia itself would make redrawn frontiers “irreversible” and enable Moscow to use “any means” to defend them.\n\nUkrainian Foreign Minister Dmytro Kuleba denounced the votes as a sham and tweeted that “Ukraine has every right to liberate its territories and will keep liberating them whatever Russia has to say.”\n\nThe votes, in territory Russia already controls, are all but certain to go Moscow’s way but are unlikely to be recognized by Western governments who are backing Ukraine with military and other support that has helped its forces seize momentum on battlefields in the east and south.\n\nAdvertisement\nRussian President Putin delivers a speech during a meeting on the military-industrial complex at the Kremlin on Sept. 20, 2022 in Moscow, Russia. Russian President Putin on Tuesday blasted what he described as U.S. efforts to preserve its global domination, saying they are doomed to fail. \nRussian President Putin delivers a speech during a meeting on the military-industrial complex at the Kremlin on Sept. 20, 2022 in Moscow, Russia. Russian President Putin on Tuesday blasted what he described as U.S. efforts to preserve its global domination, saying they are doomed to fail. Contributor via Getty Images\nIn Donetsk, part of Ukraine’s wider Donbas region that has been gripped by rebel fighting since 2014 and which Putin has set as a primary objective of the invasion, separatist leader Denis Pushilin said the vote will “restore historic justice” to the territory’s “long-suffering people.”\n\nThey “have earned the right to be part of the great country that they always considered their motherland,” he said.\n\nAdvertisement\nIn partly Russian-occupied Zaporizhzhia, pro-Russia activist Vladimir Rogov said: “The faster we become part of Russia, the sooner peace will come.”\n\nPressure inside Russia for votes and from Moscow-backed leaders in Ukrainian regions that Moscow controls increased after a Ukrainian counteroffensive — bolstered by Western-supplied weaponry — that has recaptured large areas.\n\nFormer Kremlin speechwriter and Russian political analyst Abbas Gallyamov said on Facebook that Moscow-backed separatists appeared “scared that the Russians will abandon them” amid the Ukrainian offensive and forged ahead with referendum plans to force the Kremlin’s hand.\n\nAdvertisement\nIn another signal that Russia is digging in for a protracted and possibly ramped-up conflict, the Kremlin-controlled lower of house of parliament voted Tuesday to toughen laws against desertion, surrender and looting by Russian troops. Lawmakers also voted to introduce possible 10-year prison terms for soldiers refusing to fight. If approved, as expected, by the upper house and then signed by Putin, the legislation would strengthen commanders’ hands against failing morale reported among soldiers.\n\nUkrainian soldiers ride in an armored tank in the town of Izium, recently liberated by Ukrainian Armed Forces, in the Kharkiv region. Russian troops occupied the town of Izium on April 1, 2022. \nUkrainian soldiers ride in an armored tank in the town of Izium, recently liberated by Ukrainian Armed Forces, in the Kharkiv region. Russian troops occupied the town of Izium on April 1, 2022. Photo by Oleksii Chumachenko/SOPA Images/LightRocket via Getty Images\nKremlin spokesman Dmitry Peskov said there are no prospects for a diplomatic settlement. Medvedev, who served as Russia’s president from 2008-2012, said on his messaging app channel that separatist region votes are important to protect their residents and would “completely change” Russia’s future trajectory.\n\nAdvertisement\n“After they are held and the new territories are taken into Russia’s fold, a geopolitical transformation of the world will become irreversible,” Medvedev said.\n\n“An encroachment on the territory of Russia is a crime that would warrant any means of self-defense,” he said, adding that Russia would enshrine the new territories in its constitution so no future Russian leader could hand them back.\n\n“That is why they fear those referendums so much in Kyiv and in the West,” Medvedev said. “That is why they must be held.”\n\nAdvertisement\nUkrainian analyst Volodymyr Fesenko, head of the independent Penta Center think-tank based in Kyiv, said the Kremlin hopes the votes and the possibility of military escalation will raise the pressure from Western governments for Ukrainian President Volodymyr Zelenskyy to start talks with Moscow.\n\nThe move “reflects the weakness, not the strength of the Kremlin, which is struggling to find levers to influence the situation that has increasingly spun out of its control,” he said.\n\nThe recapturing of territory, most notably in the northeastern Kharkiv region, has strengthened Ukraine’s arguments that its troops could deliver more stinging defeats to Russia with additional armament deliveries.\n\nAdvertisement\nMore heavy weaponry is on its way, with Slovenia promising 28 tanks and Germany pledging four additional self-propelled howitzers. More aid also is expected from Britain, already one of Ukraine’s biggest military backers after the U.S. British Prime Minister Liz Truss is expected to promise that in 2023, her government will “match or exceed” the 2.3 billion pounds ($2.7 billion) in military aid given to Ukraine this year.\n\nThe swiftness of the Ukrainian counteroffensive also saw Russian forces abandon armored vehicles and other weapons as they beat hasty retreats. Ukrainian forces are recycling the captured weaponry back into battle. A Washington-based think tank, The Institute for the Study of War, said abandoned Russian T-72 tanks are being used by Ukrainian forces seeking to push into Russian-occupied Luhansk.\n\nIn the counteroffensive’s wake, Ukrainian officials found hundreds of graves near the once-occupied city of Izium. Yevhenii Yenin, a deputy minister in Ukraine’s Internal Affairs Ministry, told a national telecast that officials found many bodies “with signs of violent death.”\n\nAdvertisement\n“These are broken ribs and broken heads, men with bound hands, broken jaws and severed genitalia,” he said.\n\nMeanwhile, Ukraine’s southern military command said its troops sank a Russian barge carrying troops and weapons across the Dnieper River near the Russian-occupied city of Nova Kakhovka. It offered no other details on the attack in the Russian-occupied Kherson region, which has been a major target in the Ukrainian counteroffensive.\n\nIn other developments:\n\n— Ukraine’s presidential office said fresh shelling killed three civilians and injured 19 more in a 24-hour span.\n\nAdvertisement\n— Moscow has likely moved its Kilo-class submarines from their station on the Crimean Peninsula to southern Russia over fears about them being struck by long-range Ukrainian fire, the British military said.\n\n— McDonald’s restaurants in Kyiv began serving again for the first time since the invasion, offering only delivery service initially but marking a step of sorts back toward the life Ukrainians knew before the war."
  },
  {
    "id": "4bee0739-6a45-4f9f-a00b-df06180749bd",
    "content": "“We inherit our family’s dreams, but also their fears. It takes a lot of courage to make your own path.”\n\nThat line of narration from the new documentary “Mija” — spoken by one of its subjects, musician and music manager Doris Muñoz — has stuck with me for months since its Sundance Film Festival premiere in January.\n\nThe documentary follows Muñoz and two of her clients: first, singer/songwriter Cuco and later, singer/songwriter Jacks Haupt. Muñoz’s success as a manager representing fellow Latinx artists has provided material support to her family. In the film, her parents are undergoing the arduous and bureaucratic process of applying for green cards. Muñoz, the only U.S.-born member of her immediate family, is also the liaison between them and her brother, who lives across the border in Tijuana after he was deported.\n\nIn “Mija,” Muñoz and Haupt grapple with a lot of complicated feelings that are familiar to many children of immigrants, especially those trying to make it in a creative profession. They want to live up to their parents’ expectations and make them proud, and feel obligated to help them and honor their enormous sacrifices. Amid all of that, they’re figuring out how to make it in a field where there aren’t a lot of people like them.\n\nPremiering Friday on Disney+, “Mija” is the feature debut of director Isabel Castro. She previously spent a decade in journalism, producing documentary shorts and series at the New York Times, the Marshall Project and VICE, where she was an Emmy-nominated producer for “VICE News Tonight.” As she explained in an interview, the seed for “Mija” came from a desire to tell more nuanced stories about immigration — not just about the act of immigrating or the policies behind it, but the complex emotions it brings up and “the ripple effects across different generations.”\n\nAdvertisement\nIsabel Castro, the director of \"Mija.\"\nIsabel Castro, the director of \"Mija.\"Jackie Russo\n“The range of emotions that comes along with immigrating to this country is really, really nuanced and complicated, and the spectrum is really wide,” she said. “Oftentimes, immigrant stories are very narrowly focused on exclusively the trauma of that experience.”\n\nIt’s the kind of story Castro has wanted to tell for many years, and the intersection of several of her creative goals. As a Mexican American journalist covering immigration and civil rights in the Trump era, Castro “started to feel really disillusioned by the kind of aspirations towards objectivity,” she said. “Just looking at the ways that different government policies were affecting folks on the ground, it was very difficult for me to really try to maintain objectivity.”\n\nAdvertisement\nCastro, who has a background in filmmaking but cut her teeth in journalism and documentary TV work to build a more steady career path, quit her day job and used her savings to get back into independent film. She took a course in cinematography to be able to work independently and reduce costs, since getting a film funded can be a long and cumbersome process.\n\nWhen considering what story she wanted to tell, she remembered that “I’ve always loved music docs. So I thought, ‘Oh, maybe there’s a way to have a music doc intersect with a story about immigration,’” she said. “And that’s kind of the seed that was planted.”\n\nIn 2019, Castro came across a California Sunday magazine profile about Cuco, which mentioned the work Muñoz was doing as his manager. After several phone conversations with Muñoz, Castro met her in person later that year at “Selena for Sanctuary,” a concert paying homage to the late singer and icon Selena. A few years earlier, Muñoz began the event as a way to raise money for her parents’ legal fees, and later grew it into a fundraiser for immigrant rights organizations. Soon after the two met, Muñoz agreed to be part of the documentary.\n\nAdvertisement\nDoris Muñoz and Jacks Haupt lay on a multicolored blanket in the grass, in a scene from the documentary \"Mija.\"\nDoris Muñoz and Jacks Haupt lay on a multicolored blanket in the grass, in a scene from the documentary \"Mija.\"Disney\nWhen deciding to move away from journalism and make her own feature film, Castro also wanted to be able to make more specific stylistic choices. “There’s objectivity, also, in the vernacular of imagery that journalism is told in. And I wanted to make something that felt really subjective, that felt really intentional about its POV and about the image itself being part of the messaging and the story,” she said.\n\nFor instance, “Mija” features a vibrant color palette and dream-like sequences, which were inspired by HBO’s “Euphoria.” “In terms of trying to react to or deviate from the typical ways that immigrant stories are told, I really wanted to adopt a visual language that felt really young and exciting, and so I looked a lot to ‘Euphoria,’” she said.\n\nAdvertisement\nIn choosing to have Muñoz narrate the documentary, Castro drew from the voiceover of characters like Cher Horowitz in “Clueless” and Carrie Bradshaw in “Sex and the City,” which she loved as a teen. “I really connected to Carrie and Cher, despite our huge differences, just because of the VO. I felt like there was an intimacy that was established through the voiceover,” she said. “So I always knew that I wanted to emulate that in the voiceover for the film.”\n\nLike everything else in the world, the pandemic shifted Muñoz’s life and the course of the documentary, forcing Castro to get creative with the production limitations. “I went into this thinking it would be a more traditional music doc. I thought I’d be on the road. I thought it was going to be a Chicano ‘Almost Famous,’” she said. “But the pandemic hit, and my expectations just completely went out the window.”\n\nWhile we didn’t get that road movie version of “Mija,” the film’s intimate moments of reflection lend itself well to the complicated questions it explores — the kind that don’t fit into a pithy headline or neat narrative.\n\nAdvertisement\nFor children of immigrants, in some ways, perhaps the ultimate gift to our parents is to get to make the choices they couldn’t, and to be able to move beyond basic questions of survival and material needs. But it also can be hard for our parents to understand our choices, and we can feel a sense of guilt for being able to focus on less material concerns than they did.\n\n“One of the emotions that I personally carry with me and most wanted to explore in this was the feeling of guilt,” Castro said. “And I think that that’s particularly prevalent in the stories of immigrants because migration just is inherently a traumatic experience. No matter what your story is, it’s a decision to leave your home, and it’s a decision to leave your country and your culture and move to a new place. And it’s painful.”\n\n“And I think that as children of immigrants, oftentimes you see that pain or interpret that pain, and you want to honor it,” she continued. “And sometimes, that comes along with a lot of pressure, and that pressure often comes along with feelings of guilt. So I wanted to explore those kinds of emotions. I wanted the film to live not just exclusively in the trauma of immigration, because that’s always going to be there in our lives, in our stories and in our day-to-day experiences.”\n\nAdvertisement\nCastro wants more immigration stories to capture these more complicated feelings and questions.\n\n“The nuanced emotions are the ones that I think come up more often on a day-to-day basis,” she continued. “Having covered immigration for many, many years, that is the reality of most people’s experiences that I see. It’s not something black and white.”\n\n“Mija” premieres Friday on Disney+."
  },
  {
    "id": "561f15a5-f046-4add-a256-b0208468b613",
    "content": "A white woman who said that she was unfairly fired and branded a racist by her former employer after calling the cops on a Black bird-watcher in a New York park ― leading social media users to dub her “Central Park Karen” ― has had a discrimination lawsuit thrown out.\n\nU.S. District Judge Ronnie Abrams on Wednesday dismissed the suit filed by Amy Cooper against investment firm Franklin Templeton, determining that her allegations of discrimination on the basis of race and sex — as well as defamation, negligence and intentional infliction of emotional distress — were unsubstantiated.\n\n“We are pleased that the court has dismissed the lawsuit. We continue to believe the company responded appropriately,” a representative for Franklin Templeton said in a statement to HuffPost.\n\nThe company announced Cooper’s termination on social media shortly after video of her May 2020 encounter with a man named Christian Cooper ― with whom she shares no relation ― went viral. He had asked her to leash her dog in the park, prompting the woman to call 911 and accuse the bird-watcher of threatening her.\n\nAmy Cooper is shown with her dog in a viral video from May 2020.\nAmy Cooper is shown with her dog in a viral video from May 2020.via Associated Press\nAdvertisement\n“I’m going to tell them there’s an African American man threatening my life,” she said in the video.\n\nProsecutors, who charged her with filing a false report, said that Cooper also made a second 911 call in which she claimed that a Black man “tried to assault her in the Ramble area of the park.” A judge last year agreed to drop the criminal charge against her after she completed five sessions of an educational program that included instruction about racial bias.\n\nFranklin Templeton quickly placed Cooper on administrative leave over the incident, before tweeting that the company had fired her after an internal review.\n\n“We do not tolerate racism of any kind at Franklin Templeton,” it said at the time.\n\nCooper’s lawsuit accused the company of making defamatory statements against her in that tweet and claimed that an internal investigation was not performed.\n\nAdvertisement\nAmy Cooper calls police in the viral video.\nAmy Cooper calls police in the viral video.via Associated Press\nHowever, Abrams ruled that merely watching video of the incident and holding a discussion within the company would “meet a reasonable interpretation of ‘internal review.’”\n\n“Plaintiff may take issue with the sufficiency of Defendants’ investigation into the incident, but she has not plausibly alleged that no investigation was conducted at all,” the judge said this week.\n\nAdvertisement\nIf someone inferred that the company was calling Cooper a racist in its tweet, that would constitute “protected opinion,” according to Abrams.\n\n“It is well-established that an accusation of bigotry is a protected statement of opinion, rather than a defamatory statement of fact capable of being proven true or false,” she said.\n\nAn attorney for Cooper did not immediately respond to HuffPost’s request for comment Thursday."
  },
  {
    "id": "59a7a1c6-1d31-4dc4-a04b-f73b56de3755",
    "content": "A first-of-its-kind database for tracking the world’s fossil fuel production, reserves and emissions launches on Monday to coincide with climate talks taking place at the United Nations General Assembly in New York.\n\nThe Global Registry of Fossil Fuels includes data from over 50,000 oil, gas and coal fields in 89 countries. That covers 75% of global reserves, production and emissions, and is available for public use, a first for a collection of this size.\n\nUntil now there has been private data available for purchase, and analysis of the world’s fossil fuel usage and reserves. The International Energy Agency also maintains public data on oil, gas and coal, but it focuses on the demand for those fossil fuels, whereas this new database looks at what is yet to be burned.\n\nThe registry was developed by Carbon Tracker, a nonprofit think tank that researches the energy transition’s effect on financial markets, and the Global Energy Monitor, an organization that tracks a variety of energy projects around the globe.\n\nOil Gas Coal Reserves\nOil Gas Coal Reservesvia Associated Press\nAdvertisement\nCorporations, investors and scientists already have some level of access to private data on fossil fuels. Mark Campanale, founder of Carbon Tracker, said he hopes the registry will empower groups to hold governments accountable, for example, when they issue licenses for fossil fuel extraction.\n\n“Civil society groups have got to get more of a focus on what governments are planning to do in terms of license issuance, both for coal and oil and gas, and actually begin to challenge this permitting process,” Campanale told The Associated Press.\n\nThe release of the database and an accompanying analysis of the collected data coincide with two critical sets of climate talks at the international level — the U.N. General Assembly in New York beginning on September 13, and COP27 in Sharm El Sheikh, Egypt, in November. Data like what’s being released in the registry could arm environmental and climate groups to pressure national leaders to agree to stronger policies that result in less carbon emissions.\n\nAdvertisement\nAnd we’re in dire need of carbon reductions, Campanale said.\n\nIn their analysis of the data, the developers found that the United States and Russia have enough fossil fuel still underground untapped to exhaust the world’s remaining carbon budget. That’s the remaining carbon the world can afford to emit before a certain amount of warming occurs, in this case 1.5 degrees Celsius. It also shows these reserves would generate 3.5 trillion tons of greenhouse gas emissions, which is more than all of the emissions produced since the Industrial Revolution.\n\n“We already have enough extractable fossil fuels to cook the planet. We can’t afford to use them all — or almost any of them at this point. We’ve run out of time to build new things in old ways,” said Rob Jackson, a Stanford University climate scientist who was not involved with the database.\n\n“I like the emphasis on transparency in fossil fuel production and reserves, down to specific projects. That’s a unique aspect to the work.”\n\nAdvertisement\nJackson compared the global carbon budget to a bathtub.\n\n“You can run water only so long before the tub overflows,” he said. When the tub is close to overflowing, he said, governments can turn down the faucet (mitigating greenhouse gas emissions) or open the tub’s drain more (removing carbon from the atmosphere).\n\nThe database shows that we have much more carbon than we need as a global community, Campanale said, and more than enough to overflow the bathtub and flood the bathroom in Jackson’s analogy. So investors and shareholders should be holding decision makers at the world’s largest oil, gas and coal companies accountable when they approve new investments in fossil fuel extraction, he said.\n\nCampanale said the hope is the investment community, “who ultimately own these corporations,” will use the data to begin to challenge the investment plans of companies still planning to expand oil, gas and coal projects.\n\nAdvertisement\n“Companies like Shell and Exxon, Chevron and their shareholders can use the analysis to to really begin to try and push the companies to move in a completely different direction.”\n\n___\n\nThe Associated Press Health and Science Department receives support from the Howard Hughes Medical Institute’s Department of Science Education. The AP is solely responsible for all content."
  },
  {
    "id": "5c0ba49d-4c35-4d5d-b6ad-47689bf089e3",
    "content": "Kids may say the darndest things, but parents tweet about them in the funniest ways. To that end, every week, we round up the most hilarious quips from parents on Twitter to spread the joy.\n\nScroll down to read the latest batch, and follow @HuffPostParents on Twitter for more!\n\n\nPlease keep my heartbroken toddler in your thoughts because I vacuumed up some crumbs from the floor that he was apparently very attached to.\n\n— An Apple Hat (@AnAppleHat) September 22, 2022\n\n\n\nAdvertisement\n\nI thought my 2yo would be ok w the new Cars show even though I heard it was a bit scary bc he loves Cars \u0026 has never been scared of TV but we watched the haunted house ep, he was completely silent and then at the end said “I don’t want to watch TV anymore” Did I break him??\n\n— Lucy Huber (@clhubes) September 17, 2022\nSticks and stones may break my bones because my kid left them all over the living room floor\n\n— Kevin The Dad (@kevinthedad) September 21, 2022\nAdvertisement\n“Is chicken the animal spelled the same as chicken the food?”\n- my child, about to be shook\n\n— kidversations (@kidversations_) September 20, 2022\nAccidentally put grown-up toothpaste on my toddler’s toothbrush and he screamed like I was cleaning his teeth with a Carolina Reaper dipped in Tabasco sauce.\n\n— Upside Dad (@UpsideDad) September 20, 2022\nme: I had my first crush on a girl when I was in the first grade.\n\nmy 7yo: wow that was a long time ago do you think she’s still alive?\n\n— Daddy Go Fish (@daddygofish) September 20, 2022\nAdvertisement\nsome parenting moments NO ONE can prepare you for, like the day your adorable baby runs to your arms and says “mommy I have to show you something so special to me!” and she leads you to the bathroom and unveils her incredibly special and disturbingly gigantic mound of poop\n\n— ely kreimendahl (@ElyKreimendahl) September 18, 2022\nDo tons of activities with your toddler on Saturday, let them stay up late and really wear them out so they still wake up at 4:30 on Sunday morning.\n\n— Simon Holland (@simoncholland) September 18, 2022\nMy 7-year-old son grabbed a big stick that was leaning against a building and a woman stopped him and told him it was her husband’s stick so apparently this is something he might not grow out of.\n\n— Jessie (@mommajessiec) September 19, 2022\nAdvertisement\nThe sun is shining. Birds are chirping. My husband and son are farting on one another. It truly is a wonderful life.\n\n— Arianna Bradford (@thearibradford) September 20, 2022\nMy kids are piercing their baby dolls\u0027 ears, and after much debate they decided against lip rings because - and I quote - 𝘵𝘩𝘦𝘺\u0027𝘳𝘦 𝘫𝘶𝘴𝘵 𝘣𝘢𝘣𝘪𝘦𝘴, 𝘔𝘈𝘠𝘉𝘌 𝘸𝘩𝘦𝘯 𝘵𝘩𝘦𝘺\u0027𝘳𝘦 10.\n\n— Lil Bit 🌈 (@LizerReal) September 21, 2022\nWhen your kids get too old to bring home school fundraisers, the second half of your life begins.\n\n— Rodney Lacroix (@RodLacroix) September 20, 2022\nAdvertisement\n7YO: Can I get a snack?\n\nMe: Are you feeling hungry?\n\n7YO: You don’t need to be hungry to eat a cookie!\n\n— Vinod Chhaproo (@Chhapiness) September 22, 2022\nAs a parent I really look forward to the time I get to myself, in between my child’s bedtime and when I go to sleep. All 7 minutes of it.\n\n— Laura is sofa body ready (@ericamorecambe) September 21, 2022\nSANTA IS WATCHING! Me, a Jewish mother, to her children in September.\n\n— OyVeyLady (@OyVeyLady) September 13, 2022\nAdvertisement\nI don’t know why they call it a geriatric pregnancy. It’s not like we pee our pants, wake up 40 times a night, wear our pajamas around all day and oh.\n\n— mom mom mom mom mom (@notmythirdrodeo) September 19, 2022\nMy son is singing a song he made up called \"Free the Nipples\" because he doesn\u0027t want to wear a shirt and I don\u0027t think I\u0027m mature enough to be a parent right now\n\n— KJ (@IDontSpeakWhine) September 19, 2022\nI suffer from a form of mild cognitive impairment called \"motherhood.\"\n\n— Laura Marie (@lmegordon) September 19, 2022\nAdvertisement\nMy kid just turned 4 so I keep telling her things like: 4 year olds always clean up their toys after their done playing, and 4 year olds always eat everything on their plate…so far it’s working but I suspect my time is limited\n\n— Real Life Mommy (@reallifemommy3) September 19, 2022\nMy daughter has decided she now eats dark chocolate, the one treat I never had to hide because I was the only one in the house who liked it.\n\nNothing is sacred.\n\n— SpacedMom (@copymama) September 22, 2022\nI put together a new Hot Wheels set with my 5yo and he said he was so excited that he might start crying! It was so cute that he thought it was for him.\n\n— Kevin The Dad (@kevinthedad) September 22, 2022\nAdvertisement\nMy kid sure has a lot of opinions about string cheese for someone who’s only been around for 4 years\n\n— meghan (@deloisivete) September 20, 2022\nMy 6-year-old: What\u0027s the difference between a barracuda \u0026 a shark?\n\nMe: When a barracuda is near, you\u0027ll hear a guitar riff. When it\u0027s a shark, you\u0027ll hear a tuba.\n\n— A Bearer Of Dad News (@HomeWithPeanut) September 22, 2022\nKnow More.\nDemand\nBetter.\nJoin HuffPost\nAcross Minneapolis and the nation, communities rely on reporting that uncovers the truth -- even when those in power try to hide it. By supporting HuffPost, you back journalism that defends everyone’s right to know what’s really happening.\n\nSupport HuffPost\nAlready a member? Log in to hide these messages.\n\nI typed my symptoms into DadMD and it said, “You’ll live.”\n\n— Jessie (@mommajessiec) September 21, 2022\nAdvertisement\n5 during the queen’s funeral:\n\nI can’t wait to marry Prince George and be queen of the world\n\nWhen do they all have lunch\n\nI wonder if they keep snacks in those big furry hats\n\nWhen I’m queen I’ll tell my servants to bring me a cheese bagel\n\nMummy can you bring me a cheese bagel\n\n— MumInBits (@MumInBits) September 19, 2022\nTomorrow’s dress up day for my kids school is “throwback to the 2000’s.” Pardon me while I go grab my walker."
  },
  {
    "id": "70c84402-3609-48d3-931b-edf1b4690fb5",
    "content": "Woof — it’s been a long, long week. We don’t have to tell you that.\n\nPerhaps you feel like you’ve been working like a dog. If so, may we offer you the internet equivalent of a big pile of catnip? We refer, of course, to another helping of hilarious tweets about pets.\n\nEach week, we scour Twitter to find the funniest quips and bon mots about our furballs being complete goofballs. They’re sure to make you howl.\n\n(No need to beg for more ― you can check out last week’s batch right here.)\n\n\nnot to victim blame but if my cat didn’t want 100 smooches then she shouldn’t look so stinking cute\n\n— Noëlle (@ElleExistential) September 18, 2022\n\n\nAdvertisement\n\n\n\nAdvertisement\n\n*wife from the next room*\n\"I hope you haven\u0027t spent all your months wages on something expensive and unnecessary again\"\n\nMe: pic.twitter.com/tuK01s6jCa\n\n— Paul Bronks (@SlenderSherbet) September 22, 2022\n\n\nFRAUD ALERT: Local woman makes conflicting statements about her cat, claiming he is both a \"big strong man\" and a \"tiny potato boy\". pic.twitter.com/79lsZhu52T\n\n— Cats of Yore (@CatsOfYore) September 21, 2022\nAdvertisement\n\n\n\nAdvertisement\n\nif your having a hard time right now here is a picture of my cat in a bee costume. it never fails to make me laugh pic.twitter.com/PpR8S7Lv9e\n\n— taylor! 🏳️🌈✨ (@naotoosh) September 23, 2022\n\n\nDecision making is the worst pic.twitter.com/YbzQn5v27m\n\n— 🇪🇬Omar (@Omar_pets0) September 21, 2022\nAdvertisement\n\n\n\nAdvertisement\n\n\nthey’re on a journey pic.twitter.com/fjILQKLp6g\n\n— cat in odd places (@catinoddplaces) September 21, 2022\nYour\nVoice\nIs Democracy\nAmplify what matters to you\nThis moment demands a press that cannot be bullied, bought, or silenced. It demands journalism backed by people who believe the truth is worth defending. Join HuffPost and support our mission of holding power to account.\n\nSupport HuffPost\nAlready a member? Log in to hide these messages.\n\n\nAdvertisement\n\n\nAdvertisement\n"
  },
  {
    "id": "72c8640e-c893-49a3-8594-e9f9cfcf4346",
    "content": "Some census takers who falsified information during the 2020 count didn’t have their work redone fully, weren’t fired in a timely manner and in some cases even received bonuses, according to the U.S. Commerce Department’s watchdog group.\n\nThe findings released Friday by the Office of Inspector General raise concerns about possible damage to the quality of the once-a-decade head count that determines political power and federal funding,\n\nOff-campus students at colleges and universities were likely undercounted since the census started around the same time students were sent home to stop the spread of COVID-19 in March 2020, the review found.\n\nDuring the 2020 census, The Associated Press documented cases of census takers who were pressured by their supervisors to enter false information into a computer system about homes they had not visited so they could close cases during the waning days of the census.\n\nSupervisors were able to track their census takers’ work in real time through mobile devices that the census takers used to record information about households’ numbers, demographic characteristics and members’ relationships to one another. As a result, supervisors would get alerts when actions raised red flags about accuracy, such as a census taker recording data on a home while far away from the address or a census taker conducting an interview in just a few minutes. As a quality control check, others census takers were sent back to homes to re-interview residents.\n\nAdvertisement\nThe Inspector General’s probe concluded that some alerts weren’t being properly resolved, some re-interviews weren’t properly conducted and that the work of some census takers whose work had been flagged for falsifying data had not been reworked to fix its accuracy. In fact, some census takers whose work was flagged for falsifications were given more cases, weren’t fired and were reassigned to other operations, the report said.\n\nOf the 1,400 census takers who were designated “hard fails” because questions about the accuracy of their work, only 300 were fired for misconduct or unsatisfactory performance. Of the 1,400 “hard fail” census takers, 1,300 of them received bonuses ranging from $50 to $1,600 each, the report said.\n\nThe census is the largest nonmilitary mobilization in the U.S. Data gathered during the census determines how many congressional seats each state gets. The numbers also are used for redrawing political districts and distributing $1.5 trillion in federal spending each year. Because of that, undercounts can cost communities funding.\n\nAdvertisement\nThe 2020 census faced unprecedented challenges including the pandemic, natural disasters and political interference from the Trump administration.\n\n“As a result, we asserted that the findings could not and should not be presented as a conclusive assessment of overall census quality.”\n\nIn response to the Inspector General’s report, the Census Bureau said it appreciated the concerns that were raised but disagreed with the conclusions that data quality may have been damaged since the report cited only a small number of cases out of the overall workload.\n\nAdvertisement\n“As a result, we asserted that the findings could not and should not be presented as a conclusive assessment of overall census quality,” Census Bureau Director Robert Santos said in the written response.\n\nUnder Census Bureau rules, college and university students should have been counted where they spent the most time, either at on-campus housing or off-campus apartments, even if they were sent home because of the pandemic. Most schools didn’t provide the Census Bureau with off-campus student data, and the bureau had to use a last-resort, less-accurate statistical tool to fill in the information gaps on more than 10% of the off-campus student population when they were given the information, the Inspector General’s report said.\n\nSchools often didn’t provide the data because they didn’t information on off-campus students or because of privacy concerns. The Inspector General recommends passage of legislation that would require schools to provide needed information in future head counts.\n\nAdvertisement\n“Although difficult to quantify, the fiscal implication of specifically undercounting off-campus students at the correct location for states and localities is potentially far-reaching,” the report said.\n\nThe city of Boston, which is home to Northeastern University, Boston University and several other schools, said in a challenge to its census figures that the count missed 6,000 students."
  },
  {
    "id": "814cbf9c-6094-4fca-b51f-b27b7f3d2496",
    "content": "BEIJING (AP) — President Joe Biden says U.S. forces would defend Taiwan if China tries to invade the self-ruled island claimed by Beijing as part of its territory, adding to displays of official American support for the island democracy.\n\nBiden said “yes” when asked during an interview broadcast Sunday on CBS News’s “60 Minutes” program whether “U.S. forces, U.S. men and women, would defend Taiwan in the event of a Chinese invasion.”\n\nCBS News reported the White House said after the interview U.S. policy hasn’t changed. That policy says Washington wants to see Taiwan’s status resolved peacefully but doesn’t say whether U.S. forces might be sent in response to a Chinese attack.\n\nTension is rising following efforts by Chinese President Xi Jinping’s government to intimidate Taiwan by firing missiles into the nearby sea and flying fighter jets nearby and visits to Taipei by political figures including U.S. House Speaker Nancy Pelosi.\n\nTaiwan’s foreign ministry on Monday expressed “sincere gratitude” to Biden for “affirming the U.S. government’s rock-solid promise of security to Taiwan.”\n\nAdvertisement\nTaiwan will “resist authoritarian expansion and aggression” and “deepen the close security partnership” with Washington and other governments “with similar thinking” to protect regional stability, the statement said.\n\nWashington is obligated by federal law to see that Taiwan has the means to defend itself but doesn’t say whether U.S. forces would be sent. The United States has no formal relations with the island but maintains informal diplomatic ties.\n\nTaiwan and China split in 1949 after a civil war that ended with the Communist Party in control of the mainland. The two governments say they are one country but dispute which is entitled to be the national leader.\n\nAdvertisement\nBeijing criticizes official foreign contact with Taiwan’s elected government as encouragement to make its de facto independence permanent, a step the mainland says would lead to war.\n\nWashington says it doesn’t support formal independence for Taiwan, a stance Biden repeated in the interview broadcast Sunday.\n\n“Taiwan makes their own judgments about their independence,” the president said. “We’re not encouraging their being independent.”\n\nAdvertisement\nIn May, Biden said “yes” when asked at a news conference in Tokyo whether he was willing to get involved militarily to defend Taiwan if China invaded."
  },
  {
    "id": "8591d476-6a99-4307-b303-800ed28a7a30",
    "content": "A volatile passenger has been charged with a federal crime — and banned for life from American Airlines — after he was captured on video punching a flight attendant in the head, according to Justice Department and airline officials.\n\n\nThe incident occurred Wednesday on a flight from San José del Cabo in Mexico to Los Angeles.\n\nAlexander Tung Cuu Le, 33, of Westminster, in Southern California, was arrested when the aircraft landed at Los Angeles International Airport, according to an American Airlines official. He was charged Thursday with one count of interference with flight crew members and attendants, which carries a maximum penalty of up to 20 years in prison, said a statement by the U.S. Attorney’s Office for the Central District of California.\n\n\nAccording to the statement, Le grabbed a flight attendant’s shoulder and demanded coffee about 20 minutes after the aircraft took off. He also allegedly disrupted passengers by hanging out near the first-class section of the cabin.\n\n\nWhen another flight attendant told Le to return to his assigned seat, Le “allegedly stood up and assumed a fighting stance towards the flight attendant by making closed fists with both of his hands, which the flight attendant interpreted as a threat,” according to the DOJ statement.\n\n\nA video taken by fellow passenger Barrie Livingstone shows Le apparently initially swinging his arm at the flight attendant but missing. As the attendant turned to walk away, Le can be seen rushing forward to strike the attendant in the head, eliciting cries of concern and outrage on the aircraft. The attack was “witnessed by several passengers,” the Justice Department said.\n\n\nLe then “fled” to the back of the plane, where he was “apprehended by several passengers” and crew members, the statement added.\n\n\nLe’s “hands and legs were cuffed,” but he “continuously unbuckled his seatbelt, causing flight attendants to restrain him to the seat with seatbelt extenders,” officials noted.\n\n\nLe has been barred from all future flights by American Airlines.\n\n\n“Acts of violence against our team members are not tolerated by American Airlines,” said a statement from American. “The individual involved in this incident will never be allowed to travel with us in the future, and we will work closely with law enforcement in their investigation.”\n\n\nThe airline thanked crew members and passengers for restraining Le until the aircraft was met by law enforcement at LAX.\n\n\nLe appeared Thursday at the U.S. District Court in downtown Los Angeles, where he was charged.\n\n\nThe hearing was continued to Monday, Ciaran McEvoy, a spokesperson for the U.S. attorney’s office, told SFGate. “That will be a detention hearing to determine his bond, if any. Mr. Le has not pleaded to anything yet,” McEvoy added.\n\n\nAttacks on flight attendants have skyrocketed in the last two years, largely triggered by sometimes violent, defiant responses to requirements to wear masks earlier in the COVID-19 pandemic. The Federal Aviation Administration logged an incredible 5,981 “unruly passenger reports last year. In 2020, the FAA investigated only 183 reports."
  },
  {
    "id": "a2d31282-3f07-4f18-8a87-de4560f8e48b",
    "content": "CAGUAS, Puerto Rico (AP) — More than a half million people in Puerto Rico remained without water service three days after Hurricane Fiona slammed into the U.S. territory, and many spent hours in lines Wednesday to fill jugs from water trucks while others scooped water from mountain runoff.\n\nSweat rolled down the faces of people in a long line of cars in the northern mountain town of Caguas, where the government had sent a water truck, one of at least 18 so-called “oases” set up across the island.\n\nThe situation was maddening for many people across an island once again left without basic services following a storm.\n\n“We thought we had a bad experience with Maria, but this was worse,” Gerardo Rodríguez said in the southern coastal town of Salinas, referring to the 2017 hurricane that caused nearly 3,000 deaths and demolished the island’s power grid.\n\nFiona dumped roughly two feet of rain on parts of Puerto Rico before blasting across the eastern Dominican Republic and the Turks and Caicos Islands.\n\nAdvertisement\nSwelled to Category 4 force, the storm was on a track to pass close by Bermuda early Friday and then hit easternmost Canada early Saturay, according to the U.S. National Hurricane Center.\n\nThe storm played havoc with Puerto Rico’s electrical grid, which had been patched but never fully rebuilt after Maria caused a blackout that lasted 11 months in some places.\n\nA man points to a home that was collapsed by Hurricane Fiona at Villa Esperanza in Salinas, Puerto Rico, Wednesday, September 21, 2022.\nA man points to a home that was collapsed by Hurricane Fiona at Villa Esperanza in Salinas, Puerto Rico, Wednesday, September 21, 2022.Alejandro Granadillo via Associated Press\nAdvertisement\nAs of Wednesday afternoon, roughly 70% of Puerto Rican customers lacked electricity, according to government figures.\n\nIn Caguas, the air conditioning of Emayra Veguilla’s car wasn’t working, so the bus driver propped up a small fan in the passenger seat. Earlier, she had blasted the song “Hijos del Canaveral” (“Sons of the Sugarcane Field”), written by Puerto Rican hip-hop star René Pérez as an ode to Puerto Rico and its people’s bravery.\n\n“I needed a shot of patriotism,” she said. “I needed strength to do this once again.”\n\nVeguilla had waited in line Tuesday, only to be told that the water had run out and that another truck would not be available until Wednesday.\n\nAdvertisement\nSome people ahead of Veguilla gave up and drove away, with tensions running high the longer people waited.\n\n“Move!” yelled one driver, fearful of people trying to cut in.\n\nSome who saw the line opted instead to drive to a nearby highway where fresh water trickled down the mountainside via a bamboo pipe that someone had installed.\n\nGreg Reyes, an English teacher, stood in line in muddy flip-flops to collect water for himself, his girlfriend and their cat. He had brought a large bag holding all the empty containers he could find in their house, including more than a dozen small water bottles.\n\nAdvertisement\nReyes said he and his partner had been buying water since Fiona hit, but couldn’t afford to do so any longer.\n\nStanding behind him was retiree William Rodríguez, surrounded by three large buckets and four gallon containers. He had been living in Massachusetts and decided to return to Puerto Rico about six months ago.\n\n“But I think I’m leaving again,” he said as he shook his head.\n\nThose in the line grumbled about the slow pace of recovery and accused the government of not helping them as people on social media and even a gym said their doors were open to anyone who needed water or a shower.\n\nAdvertisement\n“This hasn’t been easy,” said Juan Santos, a retiree who held the hand of his 5-year-old grandson. “We are suffering.”\n\nNone of those in line had power either, and many wondered if it would take as long to restore as it did with Hurricane Maria.\n\nPower company officials initially said it would take a few days for electricity to be restored, but then appeared to backtrack Tuesday night, saying they faced numerous obstacles.\n\nAdvertisement\n“Hurricane Fiona has severely impacted electrical infrastructure and generation facilities throughout the island. We want to make it very clear that efforts to restore and reenergize continue and are being affected by severe flooding, impassable roads, downed trees, deteriorating equipment, and downed lines,” said Luma, the company that operates power transmission and distribution.\n\nOfficials said crews found several substations underwater and inaccessible.\n\nBut Luma said it expected to restore power Wednesday to much of Puerto Rico’s north coast, which Fiona largely spared.\n\nThe hum of generators could be heard across the territory as people became increasingly exasperated.\n\n“I continue to hope that by the end of today, a large part of the population will have these services,” said Puerto Rico Gov. Pedro Pierluisi.\n\nAdvertisement\nThe head of the Federal Emergency Management Agency traveled to Puerto Rico on Tuesday and the agency announced it was sending hundreds of additional personnel to boost local response efforts. On Wednesday, U.S. President Joe Biden approved a major disaster declaration, which would allow for more federal assistance.\n\nMeanwhile, the U.S. Department of Health and Human Services declared a public health emergency in Puerto Rico and deployed a couple of teams to the island.\n\nIn the Turks and Caicos Islands, officials reported relatively light damage and no deaths, though the eye of the Category 4 storm passed close to Grand Turk, the small British territory’s capital island, on Tuesday.\n\nAdvertisement\n“Turks and Caicos had a phenomenal experience over the past 24 hours,” said Deputy Gov. Anya Williams. “It certainly came with its share of challenges.”\n\nOfficials said school on Grand Turk would reopen next week.\n\nThe Hurricane Center said Fiona had maximum sustained winds of 130 mph (215 kph) late Wednesday. It was centered about 550 miles (885 kilometers) southwest of Bermuda, heading north at 10 mph (17 kph).\n\nFiona killed a man in the French overseas department of Guadeloupe and two others in Puerto Rico swept away by swollen rivers. Two died in the Dominican Republic: one killed by a falling tree and the other by a falling electric post.\n\nAdvertisement\nTwo additional deaths were reported in Puerto Rico as a result of the blackout: A 70-year-old man burned to death after he tried to fill his running generator with gasoline and a 78-year-old man police say inhaled toxic gases from his generator.\n\n___\n\nAssociated Press journalists Maricarmen Rivera Sánchez and Alejandro Granadillo contributed to this report."
  },
  {
    "id": "afb744f9-c7d5-4158-b75a-bef5ee63c4db",
    "content": "It seems the folks at New York news channel PIX11 decided to add a little sparkle to one of this week’s segments.\n\nMichelle Ross, a reporter for the local CW affiliate, was finishing up a live on-air interview in The Battery on Wednesday when a man appeared behind her in the park and bent down on one knee.\n\nThankfully, the person Ross was interviewing didn’t give a hint as to what was happening — and as the reporter went to send the broadcast back to the studio, one of her anchors asked, “Who’s that behind you?”\n\nRoss turned around to find her boyfriend, Robert Tilearcio Jr., kneeling in front of a banner that read, “Will You Marry Me?”\n\n“I’ve waited 10 years for this,” he said in the broadcast video. “You are the love of my life, and I definitely want to ask: Will you marry me?”\n\nAdvertisement\n“I love you — of course!” Ross said, equal parts shocked and emotional.\n\n\nThe camera then panned to show Ross and Tilearcio’s nearest and dearest who showed up for the proposal as they celebrated the happy occasion.\n\nAlthough the reporter was clearly swept up in the moment, that didn’t stop her co-workers back at the studio from asking, “Michelle, who is that handsome man next to you?” Ross, still stunned, at first seemed to ignore or not hear their repeated requests, which gave a truly awkward — and, let’s admit it, “Office” like — juxtaposition to an otherwise sweet scene.\n\nAdvertisement\nDespite this, Ross seemed to appreciate the effort that Tilearcio and her PIX11 team put into the surprise proposal.\n\n“You did a good job,” she told her husband-to-be, who works for the New York City Fire Department. “Thank you, guys.”\n\nPIX11 also didn’t seem too upset about Ross initially overlooking their requests to share her fiance’s name on air. The news station posted a video of the proposal on its Instagram page Wednesday.\n\nAdvertisement\n“Congrats to PIX11′s @michellearezouross ! 💍 She was doing a live interview when her FDNY boyfriend and family members surprised her in Battery Park,” the outlet captioned the clip, using the reporter’s handle on the platform.\n\n“Spoiler alert: She said yes. ❤️”"
  },
  {
    "id": "bad31412-bf25-4a35-b2f9-b469ec2fcc32",
    "content": "TOKYO (AP) — A man set himself on fire near the Japanese prime minister’s office in Tokyo on Wednesday in an apparent protest against the state funeral planned next week for former leader Shinzo Abe, officials and media reports said.\n\nThe man, believed to be in his 70s, sustained burns on large parts of his body but was conscious and told police that he set himself on fire after pouring oil over himself, Kyodo News agency reported.\n\nA note was found with him that said, “Personally, I am absolutely against” Abe’s funeral, Kyodo reported.\n\nA Tokyo Fire Department official confirmed that a man set himself afire on the street in Tokyo’s Kasumigaseki government district and that he was alive when he was taken to a hospital by ambulance, but declined to give further details, including the man’s identity, motive or condition, citing the sensitivity of what was a police matter.\n\nPolice called it an attempted suicide and refused to give further details because the case involved no criminal intent. Police also declined to comment on a report that a police officer was caught in the fire.\n\nAdvertisement\nPolice and firefighters inspect the scene where a man is reported to set himself on fire, near the Prime Minister\u0027s Office in Tokyo, on Sept. 21, 2022. \nPolice and firefighters inspect the scene where a man is reported to set himself on fire, near the Prime Minister\u0027s Office in Tokyo, on Sept. 21, 2022. Kyodo News via AP\nThe incident underscores a growing wave of protests against the funeral for Abe, who was one of the most divisive leaders in postwar Japanese politics because of his revisionist view of wartime history, support for a stronger military, and what critics call an autocratic approach and cronyism. More protests are expected in coming days, including the day of the funeral next week.\n\nIt also is an embarrassment for police, who have stepped up security for an event expected to be attended by about 6,000 people, including U.S. Vice President Kamala Harris and other dignitaries.\n\nAdvertisement\nPolice were also partly blamed for insufficient protection of Abe, who was shot to death by a gunman who approached him from behind as he was giving an outdoor campaign speech in July.\n\nPrime Minister Fumio Kishida is in New York for the annual U.N. General Assembly meeting of world leaders. He gave a speech Tuesday expressing disappointment over the Security Council’s failure to respond to the Russian invasion of Ukraine because of Russia’s permanent veto and called for reforms that would allow the U.N. to better defend global peace and order.\n\nThe planned state funeral for Abe has become increasingly unpopular among Japanese as more details emerge about the governing Liberal Democratic Party’s and Abe’s links to the Unification Church, which built close ties with party lawmakers over their shared interests in conservative causes.\n\nAdvertisement\nShinzo Abe speaks during a news conference at the prime minister\u0027s official residence in Tokyo on Sept. 25, 2017. Japanese police said July 13, 2022, they have found a number of what they believe are bullet marks on a building near the site of former Prime Minister Shinzo Abe\u0027s assassination last week in western Japan, apparently from the first shot fired from a suspect\u0027s powerful homemade gun that narrowly missed Abe. \nShinzo Abe speaks during a news conference at the prime minister\u0027s official residence in Tokyo on Sept. 25, 2017. Japanese police said July 13, 2022, they have found a number of what they believe are bullet marks on a building near the site of former Prime Minister Shinzo Abe\u0027s assassination last week in western Japan, apparently from the first shot fired from a suspect\u0027s powerful homemade gun that narrowly missed Abe. AP Photo/Shizuo Kambayashi, File\nThe suspect in Abe’s assassination reportedly believed his mother’s large donations to the church ruined his family. The LDP has said nearly half its lawmakers have ties to the church, but party officials have denied ties between the party as an organization and the church.\n\nKishida has said Abe deserves the honor of a state funeral as Japan’s longest-serving post-World War II leader and for his diplomatic and economic achievements.\n\nAdvertisement\nCritics have said it was decided undemocratically and is an inappropriate and costly use of taxpayers’ money. They say Kishida decided to hold a state funeral to please Abe’s party faction and buttress his own power. Support ratings for Kishida’s government have weakened amid public dissatisfaction over his handling of the party’s church ties and the funeral plans.\n\nA family funeral for Abe was held at a Buddhist temple in July. The state funeral is scheduled for next Tuesday at the Budokan martial arts arena in Tokyo."
  },
  {
    "id": "bbc5a964-5def-41d4-ac65-82fe8bcd5c3e",
    "content": "WASHINGTON (AP) — An American contractor held hostage in Afghanistan for more than two years by the Taliban has been released, his family said Monday, as a Taliban drug lord jailed by the United States was also freed and returned to Kabul.\n\nMark Frerichs, a Navy veteran who had spent more than a decade in Afghanistan as a civilian contractor, was abducted in January 2020 and was believed to have been since then by the Taliban-linked Haqqani network.\n\nNegotiations for his release had centered on a deal that would also involve the release of Bashir Noorzai, a notorious drug lord and member of the Taliban who told reporters in Kabul on Monday that he spent 17 years and six months in U.S. captivity\n\nThe Biden administration did not immediately confirm details of the prisoner swap, but a sister of Frerichs, who is from Lombard, Illinois, thanked U.S. government officials who helped secure her brother’s release.\n\n“I am so happy to hear that my brother is safe and on his way home to us. Our family has prayed for this each day of the more than 31 months he has been a hostage. We never gave up hope that he would survive and come home safely to us,” said a statement from the sister, Charlene Cakora.\n\nAdvertisement\nIn Afghanistan, Noorzai told reporters at a press conference that he had been released from an unspecified U.S. prison and handed over earlier in the day to the Taliban in Kabul, in exchange for an American prisoner held in Afghanistan whom he did not identify.\n\nOther Taliban officials claimed Noorzai was held at the U.S. detention facility at Guantanamo Bay, but did not offer say anything to support that claim.\n\nThe Taliban-appointed foreign minister, Amir Khan Muttaqi, also spoke at the press conference alongside Noorzai and welcomed the exchange, saying it marked the start of a “new era” in U.S.-Taliban relations.\n\nAdvertisement\nFrerichs, abducted on Jan. 31, 2020, was last seen in a video distributed earlier this year, pleading for his release so that he can be reunited with his family, according to a recording posted by The New Yorker magazine at the time.\n\n“This can be a new chapter between Afghanistan and the United States, this can open a new door for talks between both countries,” Muttaqi said at the Kabul presser.\n\n“This act shows us that all problems can be solved through talks and I thank both sides’ teams who worked so hard for this to happen,” Muttaqi added.\n\nAdvertisement\nFrerichs, of Lombard, Illinois, was believed to be held by the Taliban-affiliated Haqqani network, and U.S. officials across two presidential administrations had tried unsuccessfully to get him home. In the video, which marked the first time Frerichs was seen since his abduction, he says it was filmed last November.\n\nVideos of hostages are sometimes released to show proof that they are alive and to facilitate negotiations for a release, though it was not immediately clear if that was the case here. The New Yorker said it obtained the clip from an unidentified individual in Afghanistan.\n\nAt the time, the FBI declined to comment on the video’s authenticity, but a sister of Frerichs, Charlene Cakora, issued a statement thanking the Taliban for releasing the video and describing it as “public confirmation of our family’s long-held belief that he is alive after more than two years in captivity.”\n\nAdvertisement\nSince their takeover of Afghanistan in August last year, the Taliban have demanded the United States release Noorzai in exchange for Frerichs amid expectations of such exchanges for U.S. citizens held in Afghanistan.\n\nHowever, there has been no public sign of Washington moving forward on any sort of prisoner trade or exchange.\n\nThe Taliban also posted a brief video Monday on social media showing Noorzai’s arrival at the Kabul airport where he was welcomed by top Taliban officials, including Muttaqi.\n\nAdvertisement\nAt the press conference, Noorzai expressed thankfulness at seeing his “mujahedeen brothers” — a reference to the Taliban — in Kabul.\n\n“I pray for more success of the Taliban,” he added. “I hope this exchange can lead to peace between Afghanistan and America, because an American was released and I am also free now.”\n\n___\n\nFaiez reported from Islamabad."
  },
  {
    "id": "c1c6fdbc-a312-43be-b886-f18561e19c39",
    "content": "HAVANA (AP) — Hurricane Fiona bore down on the Dominican Republic Monday after knocking out the power grid and unleashing floods and landslides in Puerto Rico, where the governor said the damage was “catastrophic.”\n\nNo deaths have been reported, but authorities in the U.S. territory said it was too early to estimate the damage from a storm that was still forecast to unleash torrential rain across Puerto Rico on Monday.\n\nUp to 30 inches (76 centimeters) was forecast for Puerto Rico’s eastern and southern regions.\n\n“It’s important people understand that this is not over,” said Ernesto Morales, a meteorologist with the National Weather Service in San Juan.\n\nHe said flooding has reached “historic levels,” with authorities evacuating or rescuing hundreds of people across the island.\n\n“The damages that we are seeing are catastrophic,” said Gov. Pedro Pierluisi.\n\nBrown water rushed through streets, into homes and even consumed a runway airport in southern Puerto Rico.\n\nAdvertisement\nFiona also ripped up asphalt from roads and washed away a bridge in the central mountain town of Utuado that police say was installed by the National Guard after Hurricane Maria hit in 2017 as a Category 4 storm.\n\nThe storm also ripped off the roofs of several homes, including that of Nelson Cirino in the northern coastal town of Loiza.\n\n“I was sleeping and saw when the corrugated metal flew off,” he said as he observed how the rain drenched his belonging.\n\nAdvertisement\nLuma, the company that operates power transmission and distribution, said bad weather, including winds of 80 mph, had disrupted transmission lines on Sunday, leading to “a blackout on all the island.” \nLuma, the company that operates power transmission and distribution, said bad weather, including winds of 80 mph, had disrupted transmission lines on Sunday, leading to “a blackout on all the island.” Stephanie Rojas via Associated Press\nAda Vivian Román, a 21-year-old photography student, said the storm knocked down trees and fences in her hometown of Toa Alta.\n\n“I’m actually very anxious because it’s a really slow-moving hurricane,” she said.\n\nShe said she is also worried about whether the public transportation she relies on to get to her job at a public relations agency will be operating by the time she has to go back to the office.\n\nAdvertisement\n“But I know that I’m privileged compared with other families who are practically losing their homes because they are under water,” she said.\n\nFiona was centered 50 miles (85 kilometers) southeast of Punta Cana, Dominican Republic with maximum sustained winds of 85 mph (140 kph) on Sunday night, according to the U.S. National Hurricane Center. It was moving to the northwest at 9 mph (15 kph).\n\nIt hit on the anniversary of Hurricane Hugo, which slammed into the island in 1989 as a Category 3 storm.\n\nAdvertisement\nAs authorities continue to assess the damage from Fiona, many wondered when power would be restored.\n\n“That’s probably the worst damage there is,” said Tomás Rivera, who co-owns a hotel in the southwest coastal town of El Combate.\n\nU.S. President Joe Biden declared a state of emergency in the U.S. territory as the eye of the storm approached the island’s southwest corner.\n\nThe blackout that Hurricane Maria caused was blamed for the deaths of nearly 3,000 people in the storm’s sweltering aftermath, with power in some neighborhoods not restored until a year later. Maria was a devastating Category 4 storm that struck on Sept. 20, 2017.\n\nAdvertisement\n\nLuma, the company that operates power transmission and distribution, said bad weather, including winds of 80 mph, had disrupted transmission lines on Sunday, leading to “a blackout on all the island.”\n\nHealth centers were running on generators — and some of those had failed. Health Secretary Carlos Mellado said crews rushed to repair generators at the Comprehensive Cancer Center, where several patients had to be evacuated.\n\nAdvertisement\nMore than 3,000 homes still have only a blue tarp as a roof, and infrastructure remains weak, including the power grid. Outages remain common, and reconstruction started only recently.\n\n“I think all of us Puerto Ricans who lived through Maria have that post-traumatic stress of, ‘What is going to happen, how long is it going to last and what needs might we face?’” said Danny Hernández, who works in the capital of San Juan but planned to weather the storm with his parents and family in the western town of Mayaguez.\n\n\nAdvertisement\nThe storm pummeled cities and towns along Puerto Rico’s southern coast that have not yet fully recovered from a string of strong earthquakes starting in late 2019.\n\nMore than 1,000 people with some 80 pets had sought shelter across the island by Sunday night, the majority of them in the southern coast.\n\nFiona was forecast to swipe the Dominican Republic early Monday and then northern Haiti and the Turks and Caicos Islands with the threat of heavy rain. It could threaten the far southern end of the Bahamas on Tuesday.\n\nAdvertisement\nHurricane warnings were posted for the Dominican Republic’s eastern coast from Cabo Caucedo to Cabo Frances Viejo, and for the Turks and Caicos.\n\nFiona previously battered the eastern Caribbean, killing one man in the French territory of Guadeloupe when floods washed his home away, officials said."
  },
  {
    "id": "c23fb404-762c-4137-b38e-37c27040dd19",
    "content": "NEW YORK (AP) — President Joe Biden is ready to make the case to world leaders at the U.N. General Assembly that Russia’s “naked aggression” in Ukraine is an affront to the heart of what the international body stands for as he looks to rally allies to stand firm in backing the Ukrainian resistance.\n\nBiden, during his time at the U.N. General Assembly, also planned to meet Wednesday with new British Prime Minister Liz Truss, announce a global food security initiative and press allies to meet an $18 billion target to replenish the Global Fund to Fight AIDS, tuberculosis and malaria.\n\nBut White House officials say the crux of the president’s visit to the U.N. this year would be a full-throated condemnation of Russia as its brutal war nears the seven-month mark.\n\n“He’ll offer a firm rebuke of Russia’s unjust war in Ukraine and make a call to the world to continue to stand against the naked aggression that we’ve seen these past several months,” White House national security adviser Jake Sullivan said in previewing the president’s address. “He will underscore the importance of strengthening the United Nations and reaffirm core tenets of its charter at a time when a permanent member of the Security Council has struck at the very heart of the charter by challenging the principle of territorial integrity and sovereignty.”\n\nThe address comes as Russian-controlled regions of eastern and southern Ukraine have announced plans to hold Kremllin-backed referendums in days ahead on becoming part of Russia and as Moscow is losing ground in the invasion. Russian President Vladimir Putin on Wednesday announced a partial mobilization to call up 300,000 reservists and accused the West of engaging in “nuclear blackmail.”\n\nAdvertisement\nBiden is confronting no shortage of difficult issues as leaders gather this year.\n\nPresident Joe Biden waves as he disembarks Air Force One at John F Kennedy International Airport in New York City on Sept. 20, 2022. \nPresident Joe Biden waves as he disembarks Air Force One at John F Kennedy International Airport in New York City on Sept. 20, 2022. MANDEL NGAN via Getty Images\nIn addition to the Russian war in Ukraine, European fears that a recession could be just around the corner are heightened. Administration concerns grow by the day that time is running short to revive the Iran nuclear deal and over China’s saber-rattling on Taiwan.\n\nWhen he addressed last year’s General Assembly, Biden focused on broad themes of global partnership, urging world leaders to act with haste against the coronavirus, climate change and human rights abuses. And he offered assurances that his presidency marked a return of American leadership to international institutions following Donald Trump’s “America First” foreign policy.\n\nAdvertisement\nBut one year later, global dynamics have dramatically changed.\n\nStewart Patrick, senior fellow and director of the Global Order and Institutions Program at the Washington think tank Carnegie Endowment for International Peace, wrote in an analysis that Biden’s task this year is “immense” compared to his first address to the U.N. as president.\n\n“Last year, the U.S. leader won easy plaudits as the ‘anti-Trump,’ pledging that ‘America was back,’” Patrick said. “This year demands more. The liberal, rules-based international system is reeling, battered by Russian aggression, Chinese ambitions, authoritarian assaults, a halting pandemic recovery, quickening climate change, skepticism of the U.N.’s relevance, and gnawing doubts about American staying power.”\n\nBeyond diplomacy, the president is also doing some politicking. This year’s gathering comes less than seven weeks before pivotal midterm elections in the United States. Shortly after arriving in Manhattan on Tuesday night, Biden spoke at a Democratic National Committee fundraiser for about 100 participants that raised nearly $2 million, and he’s set to hold another fundraiser on Thursday before heading back to Washington.\n\nAdvertisement\nHis Wednesday address comes on the heels of Ukrainian forces retaking control of large stretches of territory near Kharkiv. But even as Ukrainian forces have racked up battlefield wins, much of Europe is feeling painful blowback from economic sanctions levied against Russia. A vast reduction in Russian oil and gas has led to a sharp jump in energy prices, skyrocketing inflation and growing risk of Europe slipping into a recession.\n\nBiden’s visit to the U.N. also comes as his administration’s efforts to revive the 2015 Iran nuclear deal appears stalled.\n\nThe deal brokered by the Obama administration — and scrapped by Trump in 2018 — provided billions of dollars in sanctions relief in exchange for Iran’s agreement to dismantle much of its nuclear program and open its facilities to extensive international inspection.\n\nAdvertisement\nSullivan said no breakthrough with Iran is expected during the General Assembly but Biden would make clear in his speech that a deal can still be done “if Iran is prepared to be serious about its obligations.” He added that administration officials would be consulting with fellow signatories of the 2015 deal on the sidelines of this week’s meetings.\n\nMarine One carrying President Joe Biden arrives to land at the Wall Street landing zone in lower Manhattan in New York on Sept. 20, 2022. \nMarine One carrying President Joe Biden arrives to land at the Wall Street landing zone in lower Manhattan in New York on Sept. 20, 2022. MANDEL NGAN via Getty Images\nThis year’s U.N. gathering is back to being a full-scale, in-person event after two years of curtailed activity due to the pandemic. In 2020, the in-person gathering was canceled and leaders instead delivered prerecorded speeches; last year was a mix of in-person and prerecorded speeches. Biden and first lady Jill Biden were set to host a leaders’ reception on Wednesday evening.\n\nAdvertisement\nChina’s President Xi Jinping opted not to attend this year’s U.N. gathering, but his country’s conduct and intentions will loom large during the leaders’ talks.\n\nLast month, the U.N. human rights office raised concerns about possible “crimes against humanity” in China’s western region against Uyghurs and other largely Muslim ethnic groups. Beijing has vowed to suspend cooperation with the office and blasted what it described as a Western plot to undermine China’s rise.\n\nMeanwhile, China’s government on Monday said Biden’s statement in a CBS “60 Minutes” interview that American forces would defend Taiwan if Beijing tried to invade the self-ruled island was a violation of U.S. commitments on the matter, but it gave no indication of possible retaliation.\n\nAdvertisement\nThe White House said after the interview that there has been no change in U.S. policy on Taiwan, which China claims as its own. That policy says Washington wants to see Taiwan’s status resolved peacefully but doesn’t say whether U.S. forces might be sent in response to a Chinese attack."
  },
  {
    "id": "c637384c-fe6e-4b95-b8e7-e89b1d49c941",
    "content": "SAN JUAN, Puerto Rico (AP) — Hurricane Fiona barreled toward the Turks and Caicos Islands on Tuesday as a Category 3 storm, prompting the government to impose a curfew.\n\nForecasters said Fiona was expected to pass near Grand Turk, the British territory’s capital island, on Tuesday morning.\n\n“Storms are unpredictable,” Premier Washington Misick said in a statement from London, where he was attending the funeral of Queen Elizabeth II. “You must therefore take every precaution to ensure your safety.”\n\nMisick is scheduled to return home on Thursday.\n\nEarly Tuesday, Fiona was centered 20 miles (30 kilometers) southeast of Grand Turk Island. It had maximum sustained winds of 115 mph (185 kph) and was moving north-northwest at 10 mph (17 kph).\n\nThe intensifying storm kept dropping copious rain over the Dominican Republic and Puerto Rico, where a 58-year-old man died after police said he was swept away by a river in the central mountain town of Comerio.\n\nAdvertisement\nAnother death was linked to a power blackout — a 70-year-old man was burned to death after he tried to fill his generator with gasoline while it was running, officials said.\n\nThe National Guard has rescued more than 900 people as floodwaters continue to rush through towns in eastern and southern Puerto Rico with up to 30 inches (76 centimeters) of rain forecast for some areas. Multiple landslides also were reported.\n\nA man walks on the beach next to waves kicked up by Hurricane Fiona in Punta Cana, Dominican Republic, on Sept. 19, 2022.\nA man walks on the beach next to waves kicked up by Hurricane Fiona in Punta Cana, Dominican Republic, on Sept. 19, 2022.AP Photo/Ricardo Hernandez\nAdvertisement\nThe blow from Fiona was made more devastating because Puerto Rico has yet to recover from Hurricane Maria, which killed nearly 3,000 people and destroyed the power grid in 2017. Five years later, more than 3,000 homes on the island are still covered by blue tarps.\n\nAuthorities said at least 1,300 people and some 250 pets remain in shelters across the island.\n\nFiona sparked a blackout when it hit Puerto Rico’s southwest corner on Sunday, the anniversary of Hurricane Hugo, which slammed into the island in 1989 as a Category 3 storm.\n\nBy Tuesday morning, authorities said they had restored power to more than 260,000 customers on the island of 3.2 million people.\n\nAdvertisement\nPuerto Rico Gov. Pedro Pierluisi has warned it could take days before everyone has electricity.\n\nWater service was cut to more than 837,000 customers — two thirds of the total on the island — because of turbid water at filtration plants or lack of power, officials said.\n\nFiona is not expected to threaten the U.S. mainland.\n\nThe low-lying Turks and Caicos Islands were bracing September 19, 2022, for Hurricane Fiona\u0027s arrival. The government of the British Overseas territory ordered a shutdown for the islands of South Caicos, Salt Cay and Grand Turk, the capital. \nThe low-lying Turks and Caicos Islands were bracing September 19, 2022, for Hurricane Fiona\u0027s arrival. The government of the British Overseas territory ordered a shutdown for the islands of South Caicos, Salt Cay and Grand Turk, the capital. Miami Herald via Getty Images\nIn the Dominican Republic, authorities reported one death: a man hit by a falling tree. The storm displaced more than 12,400 people and cut off at least two communities.\n\nAdvertisement\nThe hurricane left several highways blocked, and a tourist pier in the town of Miches was badly damaged by high waves. At least four international airports were closed, officials said.\n\nThe Dominican president, Luis Abinader, said authorities would need several days to assess the storm’s effects.\n\nFiona previously battered the eastern Caribbean, killing one man in the French territory of Guadeloupe when floodwaters washed his home away, officials said."
  },
  {
    "id": "ca0e3c1a-8af8-4bca-babc-08f3acf6ea6f",
    "content": "COLUMBIA, S.C. (AP) — A 63-year-old worker died in the public bathroom of a South Carolina department store, but her body was not discovered for four days, authorities said.\n\nBessie Durham, who worked for an outside company that cleans the Belk store at Columbiana Centre, was found dead Monday, investigators said. Her cleaning cart was outside the restroom.\n\nDurham was last seen Thursday at work and her body was found shortly after her family filed a missing person report, Columbia Deputy Police Chief Melron Kelly, told WIS-TV.\n\nThe Lexington County Coroner’s Office said there are no signs someone killed Durham or that she was using drugs. An autopsy is planned Thursday to determine her cause of death.\n\nDurham was seen on a surveillance camera going in the bathroom at 7 a.m. Thursday and she did not come out. Her body was found around 8 p.m. Monday, the coroner’s office said.\n\nAdvertisement\nThe store was open regularly over those four days and Kelly said police are investigating to see if anyone was negligent.\n\n“We’re still working with the store to find out what their process is to closing down the store, inspecting the store and things of that nature,” Kelly said.\n\nBelk is helping authorities figure out what happened and is sending its deepest condolences to Durham’s family, the company said in a statement.\n\nAdvertisement\n"
  },
  {
    "id": "cb382a50-9348-48f2-ad5b-02259454ac63",
    "content": "NEW YORK (AP) — After a year spent off-air, the Golden Globe Awards are returning to NBC in January, when the embattled Hollywood Foreign Press Association will seek a primetime comeback.\n\nNBC, the Hollywood Press Association and dick clark productions on Tuesday made the Globes’ return official. The 80th Golden Globes will be held January 10, airing both on NBC and Peacock.\n\nFor the past year and half, Hollywood has effectively boycotted the Globes, for years one of the most-watched award shows after the Academy Awards. But after the Los Angeles Times reported ahead of the 2021 broadcast that the HFPA’s 87 members of non-American journalists included no Black members, studios, publicists and stars said they would cease participating in the Globes. Tom Cruise returned his three Golden Globe awards.\n\nSince then, the HFPA has reorganized itself, revamped its membership and enacted reforms designed to curtail the kinds of unethical behavior the group has long been criticized for. The HFPA added new members, including six Black voting members, and recently added 103 international, nonmember voters. The HFPA on Tuesday said their voting body is now 52% female, 19.5% Latino, 12% Asian, 10% Black and 10% Middle Eastern.\n\n“We recognize the HFPA’s commitment to ongoing change and look forward to welcoming back the Golden Globes to NBC for its landmark 80th Anniversary in January 2023,” said Frances Berwick, chairman of entertainment networks for NBCUniversal.\n\nAdvertisement\nNBC had reason to want to get the Globes back on the air. In 2018, the network signed an eight-year deal to continue airing the awards through 2026. Citing the HFPA’s ongoing reforms, NBC elected not to televise the previous Golden Globes in January. The organization went ahead announcing awards, anyway, in an untelevised and little-noticed gathering unattended by nominees.\n\nThis year’s ceremony, the organizations said, will be broadcast in a one-year agreement. Terms were unavailable but the deal is expected to be less than the approximately $60 million the network previously paid annually to air the Globes. With backlash swirling and the ceremony scaled down because of the pandemic, the 2021 Globes were watched by 6.9 million people, according to Nielsen, down from more than 18 million the year before.\n\nWhether NBC’s endorsement will be enough to return the Globes to Hollywood’s good graces, however, remains to be seen. Nominations to the Globes will be announced Dec. 12.\n\nAdvertisement\nThe HFPA is currently being run by interim Chief Executive Todd Boehly, whose investment firm, Eldridge Industries, bought the Globes and turned it from a nonprofit into a for-profit venture. Boehly’s firm is also the parent company of dick clark productions, the awards’ producer, and the owner of the Globes’ longtime home, the Beverly Hilton."
  },
  {
    "id": "d270b418-77ee-44af-9368-4e0b6fe56468",
    "content": "U.S. health officials say 4.4 million Americans have rolled up their sleeves for the updated COVID-19 booster shot. The Centers for Disease Control and Prevention posted the count Thursday as public health experts bemoaned President Joe Biden’s recent remark that “the pandemic is over.”\n\nThe White House said more than 5 million people received the new boosters by its own estimate that accounts for reporting lags in states.\n\nHealth experts said it is too early to predict whether demand would match up with the 171 million doses of the new boosters the U.S. ordered for the fall.\n\n“No one would go looking at our flu shot uptake at this point and be like, ‘Oh, what a disaster,’” said Dr. David Dowdy, an infectious disease epidemiologist at Johns Hopkins Bloomberg School of Public Health. “If we start to see a large uptick in cases, I think we’re going to see a lot of people getting the (new COVID) vaccine.”\n\nA temporary shortage of Moderna vaccine caused some pharmacies to cancel appointments while encouraging people to reschedule for a Pfizer vaccine. The issue was expected to resolve as government regulators wrapped up an inspection and cleared batches of vaccine doses for distribution.\n\nAdvertisement\n“I do expect this to pick up in the weeks ahead,” said White House COVID-19 coordinator Dr. Ashish Jha. “We’ve been thinking and talking about this as an annual vaccine like the flu vaccine. Flu vaccine season picks up in late September and early October. We’re just getting our education campaign going. So we expect to see, despite the fact that this was a strong start, we actually expect this to ramp up stronger.”\n\nSome Americans who plan to get the shot, designed to target the most common omicron strains, said they are waiting because they either had COVID-19 recently or another booster. They are following public health advice to wait several months to get the full benefit of their existing virus-fighting antibodies.\n\nOthers are scheduling shots closer to holiday gatherings and winter months when respiratory viruses spread more easily.\n\nAdvertisement\nRyan Dutton, an EMT from Rescue Inc., prepares shots of the Pfizer booster of the COVID-19 vaccine during a vaccine clinic held by Rescue Inc. at Leland \u0026 Gray Middle and High School, in Townshend, Vt., on Sept. 20, 2022.\nRyan Dutton, an EMT from Rescue Inc., prepares shots of the Pfizer booster of the COVID-19 vaccine during a vaccine clinic held by Rescue Inc. at Leland \u0026 Gray Middle and High School, in Townshend, Vt., on Sept. 20, 2022.Kristopher Radder/The Brattleboro Reformer via Associated Press\nRetired hospital chaplain Jeanie Murphy, 69, of Shawnee, Kansas, plans to get the new booster in a couple of weeks after she has some minor knee surgery. Interest is high among her neighbors from what she sees on the Nextdoor app.\n\n“There’s quite a bit of discussion happening among people who are ready to make appointments,” Murphy said. “I found that encouraging. For every one naysayer there will be 10 or 12 people who jump in and say, ‘You’re crazy. You just need to go get the shot.’”\n\nAdvertisement\nBiden later acknowledged criticism of his remark about the pandemic being over and clarified the pandemic is “not where it was.” The initial comment didn’t bother Murphy. She believes the disease has entered a steady state when “we’ll get COVID shots in the fall the same as we do flu shots.”\n\nExperts hope she’s right, but are waiting to see what levels of infection winter brings. The summer ebb in case numbers, hospitalizations and deaths may be followed by another surge, Dowdy said.\n\nDr. Anthony Fauci, asked Thursday by a panel of biodefense experts what still keeps him up at night, noted that half of vaccinated Americans never got an initial booster dose.\n\nAdvertisement\n“We have a vulnerability in our population that will continue to have us in a mode of potential disruption of our social order,” Fauci said. “I think that we have to do better as a nation.”\n\nSome Americans who got the new shots said they are excited about the idea of targeting the vaccine to the variants circulating now.\n\n“Give me all the science you can,” said Jeff Westling, 30, an attorney in Washington, D.C., who got the new booster and a flu shot on Tuesday, one in each arm. He participates in the combat sport jujitsu, so wants to protect himself from infections that may come with close contact. “I have no issue trusting folks whose job it is to look at the evidence.”\n\nAdvertisement\nMeanwhile, Biden’s pronouncement in a “60 Minutes” interview broadcast Sunday echoed through social media.\n\n“We still have a problem with COVID. We’re still doing a lot of work on it. But the pandemic is over,” Biden said while walking through the Detroit auto show. “If you notice, no one’s wearing masks. Everybody seems to be in pretty good shape. And so I think it’s changing.”\n\n\nAdvertisement\nBy Wednesday on Facebook, when a Kansas health department posted where residents could find the new booster shots, the first commenter remarked snidely:\n\n“But Biden says the pandemic is over.”\n\nThe president’s statement, despite his attempts to clarify it, adds to public confusion, said Josh Michaud, associate director of global health policy with the Kaiser Family Foundation in Washington.\n\n“People aren’t sure when is the right time to get boosted. ‘Am I eligible?’ People are often confused about what the right choice is for them, even where to search for that information,” Michaud said.\n\nAdvertisement\n“Any time you have mixed messages, it’s detrimental to the public health effort,” Michaud said. “Having the mixed messages from the president’s remarks, makes that job that much harder.”\n\nUniversity of South Florida epidemiologist Jason Salemi said he’s worried the president’s pronouncement has taken on a life of its own and may stall prevention efforts.\n\n“That soundbite is there for a while now, and it’s going to spread like wildfire. And it’s going to give the impression that ‘Oh, there’s nothing more we need to do,’” Salemi said.\n\nAdvertisement\n“If we’re happy with 400 or 500 people dying every single day from COVID, there’s a problem with that,” Salemi said. “We can absolutely do better because most of those deaths, if not all of them, are absolutely preventable with the tools that we have.”\n\nNew York City photographer Vivienne Gucwa, 44, got the new booster Monday. She’s had COVID twice, once before vaccines were available and again in May. She was vaccinated with two Moderna shots, but never got the original boosters.\n\n“When I saw the new booster was able to tackle omicron variant I thought, ‘I’m doing that,’” Gucwa said.\n\nAdvertisement\n“I don’t want to deal with omicron again. I was kind of thrilled to see the boosters were updated.”\n\n___\n\nAP Medical Writer Lauran Neergaard and AP White House Correspondent Zeke Miller contributed. ___\n\nThe Associated Press Health and Science Department receives support from the Howard Hughes Medical Institute’s Department of Science Education. The AP is solely responsible for all content."
  },
  {
    "id": "e1d595c2-4d98-43ec-aa6d-6640890ae697",
    "content": "A Twitch streamer’s claim that he scammed people out of more than $200,000 to feed his gambling habit has created an uproar among users and drawn a response from the streaming platform this week.\n\nAbraham Mohammed, also known as the streamer Sliker, revealed via his stream on Saturday that he got money from Twitch viewers and streamers after claiming he needed to borrow it to avoid financial issues, Kotaku reported.\n\nHe then said he actually intended to use the money to feed a gambling addiction to the game Counter-Strike: Global Offensive, the website reported.\n\nThe revelation caused top streamers, including Devin Nash, Pokimane and Mizkif, to support plans for a boycott around the week of Christmas that would call on Twitch to make a statement about gambling streams and sponsorships.\n\nKotaku reported that Twitch content creators have contended that “rich creators promoted harmful content to young, impressionable fans” via the platform through gambling.\n\nAdvertisement\nTwitch responded to the backlash and the possibility of a streamers’ boycott by announcing its plan to ban streaming of certain gambling sites on its platform.\n\nThe platform tweeted Tuesday that it planned to prohibit sites that include slots, roulette or dice games that “aren’t licensed either in the U.S. or other jurisdictions that provide sufficient consumer protection.”\n\nTwitch’s policy change is scheduled to take place Oct. 18.\n\n\nAdvertisement\nTwitch said it plans to ban the streaming of sites such as Duelbits.com, Rollbit.com, Stake.com and Roobet.com, and may identify more sites going forward.\n\nThe policy change won’t affect sports betting, fantasy sports and poker, Twitch said.\n\nStreamers such as Pokimane, who gathered more than 312,000 likes expressing support of a ban on gambling streams, wrote “we did it y’all” following the policy change Tuesday.\n\n\nAdvertisement\nNash, who emphasized that the ban was “NOT a gambling ban” in a Twitter thread, wrote that the policy change leaves room for gambling to continue to exist on Twitch.\n\n“We will need to see the full effects of this policy update on October 18th. In its current wording, this isn’t even close to a luck-based gambling ban,” Nash wrote."
  },
  {
    "id": "e8d92251-7695-4f48-a241-ec36bb69f66e",
    "content": "GENEVA (AP) — FIFA came under pressure Wednesday from several European soccer federations who want their captains to wear an armband with a rainbow heart design during World Cup games in Qatar to campaign against discrimination.\n\nFrance and Germany, the last two World Cup champions, were among eight of the 13 European soccer teams going to Qatar who joined the “One Love” campaign, which started in the Netherlands. The Dutch team plays Qatar in Group A on Nov. 29.\n\nFIFA rules prohibit teams from bringing their own armband designs to the World Cup and insist they must use equipment provided by the governing body.\n\nArmbands are the latest battleground for players to push political messages linked to the World Cup hosted in Qatar, where homosexual acts are illegal and the treatment of migrant workers building projects for the tournament has been a decade-long controversy.\n\n“Wearing the armband together on behalf of our teams will send a clear message when the world is watching,” England captain Harry Kane said in a statement.\n\nAdvertisement\nThe Swiss soccer federation said it wanted captain Granit Xhaka to wear an armband on which “you can see a heart with diverse colors which represent the diversity of humanity.”\n\nSoccer players have embraced their platform to make statements in recent years. Taking a knee on the field was routine before Premier League games for two seasons after the death of George Floyd, a Black man killed by a police officer in the United States.\n\nFIFA supported taking a knee and now has to decide whether to back some of its most influential member federations in a gesture that could embarrass Qatar.\n\nAdvertisement\n“A request to FIFA has also been submitted asking that permission be provided for the armbands to be worn throughout the FIFA World Cup,” the Welsh soccer federation said in a statement.\n\nFIFA did not immediately comment on the request.\n\nThe armbands can be worn at UEFA-organized games in the Nations League this week, including by both captains when Belgium hosts Wales on Thursday.\n\nThe campaign for the armbands was launched one day after the Emir of Qatar spoke at the United Nations General Assembly in New York promising a World Cup without discrimination.\n\nAdvertisement\n“The Qatari people will receive with open arms football fans from all walks of life,” Sheikh Tamim bin Hamad al-Thani said in a speech to other world leaders.\n\nThe eight European teams backing the “One Love” campaign for human rights also included Belgium and Denmark. The five European qualifiers for the World Cup not taking part Wednesday were Croatia, Poland, Portugal, Serbia and Spain.\n\nHowever, Poland captain Robert Lewandowski — a two-time FIFA world player of the year — said this week he would take an armband in the blue and yellow colors of Ukraine’s flag to Qatar.\n\nAdvertisement\nPoland refused to play Russia, the 2018 World Cup host, in a playoff match in March. Before the game, FIFA and European soccer body UEFA banned Russian teams from international competitions because the country invaded Ukraine.\n\nThe campaign for the armbands emerged while a panel of UEFA member federations monitored progress in Qatar on labor law reforms and other human rights ahead of the tournament.\n\nThat panel includes the Norwegian soccer federation, whose president Lise Klaveness delivered a scathing criticism of the Qatari project at an annual FIFA meeting in March in Doha on the eve of the tournament draw.\n\nAdvertisement\nEngland and Wales were among the federations Wednesday acknowledging progress made in Qatar since the wealthy emirate won the World Cup hosting vote in December 2010.\n\nHowever, the English federation said players would meet with some migrant workers who will be invited to its training camp in Al Wakrah.\n\nEngland also added to support already expressed in Germany this week for FIFA and World Cup organizers to compensate the families of construction workers who came to Qatar to help build stadiums, metro lines and hotels.\n\nAdvertisement\nAmnesty International has suggested FIFA should pay $440 million in reparations to equal the prize money being paid to the 32 teams in Qatar.\n\nAt a German federation event on Monday, an invited fan who is gay used the platform to urge the Qatari ambassador that his country should abolish laws against homosexuality. The ambassador, Abdulla bin Mohammed bin Saud Al Thani, complained that human rights issues were distracting from the tournament."
  },
  {
    "id": "f593d56b-1d82-48fc-840a-63d5bf0653bb",
    "content": "SAN JUAN, Puerto Rico (AP) — Hurricane Fiona threatened to strengthen into a Category 4 storm Wednesday as it lashed the Turks and Caicos Islands and was forecast to squeeze past Bermuda later this week.\n\nThe storm was blamed for causing at least four direct deaths in its march through the Caribbean, where it unleashed torrential rain in Puerto Rico, leaving a majority without power or water as hundreds of thousands of people scraped mud out of their homes following what authorities described as “historic” flooding.\n\nPower company officials initially said it would take a couple of days for electricity to be fully restored but then appeared to backtrack late Tuesday night.\n\n“Hurricane Fiona has severely impacted electrical infrastructure and generation facilities throughout the island. We want to make it very clear that efforts to restore and reenergize continue and are being affected by severe flooding, impassable roads, downed trees, deteriorating equipment, and downed lines,” said Luma, the company that operates power transmission and distribution.\n\nNeighbors work to recover their belongings from the flooding caused by Hurricane Fiona in the Los Sotos neighborhood of Higüey, Dominican Republic, on Sept. 20, 2022.\nNeighbors work to recover their belongings from the flooding caused by Hurricane Fiona in the Los Sotos neighborhood of Higüey, Dominican Republic, on Sept. 20, 2022.AP Photo/Ricardo Hernandez\nAdvertisement\nThe hum of generators could be heard across the island as people became increasingly exasperated, with some still trying to recover from Hurricane Maria, which hit as a Category 4 storm five years ago, killing an estimated 2,975 people in its aftermath.\n\nLuis Noguera, who was helping clear a landslide in the central mountain town of Cayey, said Maria left him without power for a year.\n\n“We paid an electrician out of our own pocket to connect us,” he recalled, adding that he doesn’t think the government will be of much help again after Fiona.\n\nAdvertisement\nLong lines were reported at several gas stations across Puerto Rico, and some pulled off a main highway to collect water from a stream.\n\n“We thought we had a bad experience with Maria, but this was worse,” said Gerardo Rodríguez, who lives in the southern coastal town of Salinas.\n\nParts of the island had received more than 25 inches (64 centimeters) of rain and more had fallen on Tuesday.\n\nAdvertisement\nBy late Tuesday, authorities said they had restored power to nearly 300,000 of the island’s 1.47 million customers, while water service was cut to more than 760,000 customers — two thirds of the total on the island.\n\nThe head of the Federal Emergency Management Agency traveled to Puerto Rico on Tuesday as the agency announced it was sending hundreds of additional personnel to boost local response efforts.\n\nMeanwhile, the U.S. Department of Health and Human Services declared a public health emergency on the island and deployed a couple of teams to the U.S. territory.\n\nAdvertisement\nNicasio Gil walks through the stagnant water left by the swollen Duey river after the passing of Hurricane Fiona in the Los Sotos neighborhood of Higüey, Dominican Republic, on Sept. 20, 2022.\nNicasio Gil walks through the stagnant water left by the swollen Duey river after the passing of Hurricane Fiona in the Los Sotos neighborhood of Higüey, Dominican Republic, on Sept. 20, 2022.AP Photo/Ricardo Hernandez\nIn the Turks and Caicos Islands, officials reported minimal damage and no deaths despite the storm’s eye passing close to Grand Turk, the small British territory’s capital island, on Tuesday morning.\n\nTh government had imposed a curfew and urged people to flee flood-prone areas.\n\n“Turks and Caicos had a phenomenal experience over the past 24 hours,” said Deputy Gov. Anya Williams. “It certainly came with its share of challenges.”\n\nAdvertisement\nLate Tuesday night, Fiona was centered about 95 miles (155 kilometers) north of NORTH CAICOS ISLAND, with hurricane-force winds extending up to 30 miles (45 kilometers) from the center. It had maximum sustained winds of 125 mph (205 kph) and was moving north at 8 mph (13 kph), according to the Hurricane Center, which said the storm was likely to strengthen into a Category 4 hurricane as it approaches Bermuda on Friday.\n\nThe storm killed a man in the French Caribbean territory of Guadeloupe, another man in Puerto Rico who was swept away by a swollen river and two people in the Dominican Republic: one killed by a falling tree and the other by a falling electric post.\n\n___\n\nAssociated Press videographer Alejandro Granadillo contributed to this report."
  },
  {
    "id": "f814e105-9f4c-4ebf-b346-9ddddc2d76ac",
    "content": "UNCASVILLE, Conn. (AP) — Las Vegas never had a professional sports champion — until Sunday.\n\nChelsea Gray scored 20 points to lead the Las Vegas Aces to their first WNBA title, and the city’s first pro title, in a 78-71 road win over the Connecticut Sun in Game 4.\n\nGray went 9 of 13 from the floor, and was named Finals MVP after averaging 18.3 points in the series.\n\nVegas finished on an 8-0 run. As the buzzer sounded, league MVP A’ja Wilson, who played every minute of the game, grabbed the ball and stomped the floor before being mobbed by her teammates.\n\n“We champs! We champs! We champs!” Wilson screamed at teammates as they pulled on their championship hats and T-shirts before the trophy ceremony.\n\nRiquna Williams had 17 points for Vegas, Kelsey Plum added 16 points, Jackie Young had 13 and Wilson added 11 points to go with her 14 rebounds.\n\nAdvertisement\nWilson hopes this is just the beginning for the franchise.\n\n“You see it. You see it,” Wilson said in the on-court celebration. “This is what we’re building. This is what we’re doing. This is it. I’m so happy right now.”\n\nLas Vegas Aces\u0027 Chelsea Gray (12) went 9 of 13 from the floor, and was named Finals MVP after averaging 18.3 points in the series.\nLas Vegas Aces\u0027 Chelsea Gray (12) went 9 of 13 from the floor, and was named Finals MVP after averaging 18.3 points in the series.Jessica Hill via Associated Press\nCourtney Williams had 17 points to lead Connecticut and Alyssa Thomas had her second straight triple-double with 11 points, 11 assists and 10 rebounds. Jonquel Jones added 13 points and DeWanna Bonner had 12.\n\nAdvertisement\n“When you come up short it certainly, really hurts,” Sun coach Curt Miller said. “But that means that there was something that mattered, and something special among that group of players.”\n\nFor Aces coach Becky Hammon, who didn’t get a title in her standout WNBA career, the ring completed a decades-long quest. She left an assistant coach position with Gregg Popovich and the San Antonio Spurs to take over in Las Vegas. The move paid off.\n\n“They’re unbelievable on the court, but they’re unbelievable humans, first and foremost,” Hammon said. “They care about each other. They invest in each other. It’s been an absolute honor to be their coach. I saw excellence and I wanted to be a part of it.”\n\nAdvertisement\nHammon also paid tribute to former Aces coach Bill Laimbeer, who was on the floor for the ceremony: “He put this team together and saw the pieces.”\n\n\nAces owner Mark Davis, who also owns the NFL’s Las Vegas Raiders, wasn’t with his football team Sunday. He was in Connecticut to get a trophy. He hoisted it, then turned it over to gleeful players who did the same.\n\nAdvertisement\n“Las Vegas, we are world champions,” Davis said.\n\nThe Aces led by two points at the half and four points after three quarters. They held a six-point lead in the fourth when Plum was called for a flagrant foul after running into Bonner while the Sun guard was attempting a 3-pointer and sending her to the floor holding her right ankle.\n\nBonner hit all three free throws before Jones’ short jumper cut the lead to a point. The Sun then tied the game at 67 on free throw by Courtney Williams and took a 71-70 lead on two fouls shots from Brionna Jones.\n\nBut Las Vegas had the answers.\n\nRiquna Williams 3-pointer put the Aces back on top and Gray’s step-back jumper extended the lead back to 75-71 with under a minute left. A’ja Wilson then stole a pass and Plum hit a short jump shot to secure the win.\n\nAdvertisement\n\nSCRAPPY GAME\nAs expected, it was a physical game — appropriately played on an NFL Sunday. The Sun got a scare when Bonner took an inadvertent elbow to the gut from Gray late in the first quarter and was on the floor for a few minutes before being helped to the bench. She came back into the game later in the half, apparently suffering no ill effects. Natisha Hiedeman and Plum got into a short pushing match in the second quarter, eliciting technical fouls for both players. That was all before Plum’s flagrant in the fourth.\n\nNO GRAY AREA\nGray wasn’t a WNBA All-Star this season, nor was she a first-team all-league pick, and had voiced her displeasure about that. After scoring 21 points in each of the first two games of the Finals, she scored just 11 points in Game 3, but bounced back. Way back.\n\nAdvertisement\n“They can keep that All-Star and first team,” Gray said. “I got the ring.”\n\nINCLUSIVE ORGANIZATIONS\nBefore the game, both coaches reflected on the makeup of organizations in the Final. The Aces are led by Hammon and two Black women executives in general manager Natalie Williams and Nikki Fargas, president of business operations. The Sun are owned by the Mohegan Tribe, have a woman president in Jen Rizzotti and are coached by Curt Miller, a gay man.\n\n“Women’s basketball is such a story in terms of diversity and inclusion. I mean, our league defines it and I’m so proud to be a part of it,” Miller said, adding that he hopes to be an inspiration to any gay child “wondering if they can chase a career in sports.”\n\nHammon said she believes the diversity in her team’s front office has made it stronger.\n\n“You can make a lot better picture with a box full of crayons than just a pencil,” she said.\n\n\nAdvertisement\nVEGAS PRIDE AND PARADE\nThe start of the celebration was shown on the video screens at the Raiders’ stadium during the NFL game against Arizona on Sunday, with fans breaking into loud cheers.\n\nThey can cheer more in a few days: a parade on the Las Vegas Strip is planned for Tuesday night.\n\n“What a team, what talent, what a victory! You have made Las Vegas so proud!” Las Vegas Mayor Carolyn Goodman said in a statement. “Thank you for your effort, discipline \u0026 focus. We can’t wait for the celebrations \u0026 a great parade!”\n\nWilson said after the game that paradegoers should be ready for a party: “When you come to the parade, you better be four shots in. If you ain’t four shots in, don’t come.”\n\nAdvertisement\nTIP-INS\nThe Aces improved to 4-0 in this year’s playoffs with two days rest. ... Vegas is the fourth WNBA team to win a title with both a league MVP and coach of the year ... The Sun came up short after having been among the last four WNBA teams standing for each of the last four seasons, making it back to the Finals for the first time since 2019.\n\n“Nobody expected us to be here,” Bonner said. “They expected us to lose to Chicago. They expected us to lose to Dallas. Despite all of that, we made it to the Finals.” ___\n\nThis story has been corrected to show the Aces’ general manager’s first name is Natalie."
  }
]